[
  {
    "id": "B0BC8SFTGR",
    "url": "https://www.amazon.com/dp/B0BC8SFTGR?th=1&psc=1",
    "url_status": "0",
    "match_type": "Amazon Page Problem"
  },
  {
    "id": "B0BVB22FB2",
    "url": "https://www.amazon.com/dp/B0BVB22FB2?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "Women's Semi Formal Dresses Fashion Casual Slim Fit Polka Dot Print Round Neck Dress Casual Summer Dresses      \nMaterial: 97% Polyester,3% Spandex",
    "brand": "Generic",
    "manufacturerName": null,
    "shortDescription": "Women's Semi Formal Dresses Fashion Casual Slim Fit Polka Dot Print Round Neck Dress Casual Summer DressesPlease check the Size Chart before . If you are not sure the size, please send message to us.  features: 1. Made of high quality material, durable and suitable for daily wear2. The fashionable design makes you more attractive, so you can let your fashion and   in front of your family and at Christmas and show your charm3. This dress is so beautiful! Comfortable fabric! Don't this skirt, you must wear it.4. Suitable for party, daily and casual, I am sure you will love it!Product Information.Suitable for:WomenOccasion: party, daily and casualStyle:CasualFit: Thickness:Washing : Hand wash Cold storage, hanging or dryingPlease excuse me, I got: 1 dress",
    "specifications": [
      {
        "key": "Fabric Type",
        "value": "❥ Product Information.Suitable For:Women"
      },
      {
        "key": "Care Instructions",
        "value": "❥ Please Check The Size Chart Before Order. If You Are Not Sure The Size, Please Send Message To Us. Features:"
      },
      {
        "key": "Origin",
        "value": "Made in USA and Imported"
      },
      {
        "key": "Fur Description",
        "value": "❥ Made Of High Quality Material, Durable And Suitable For Daily Wear"
      }
    ],
    "specifications_b": [
      {
        "key": "Fabric Type",
        "value": "❥ Product Information.Suitable For:Women"
      },
      {
        "key": "Care Instructions",
        "value": "❥ Please Check The Size Chart Before Order. If You Are Not Sure The Size, Please Send Message To Us. Features:"
      },
      {
        "key": "Origin",
        "value": "Made in USA and Imported"
      },
      {
        "key": "Fur Description",
        "value": "❥ Made Of High Quality Material, Durable And Suitable For Daily Wear"
      }
    ],
    "aboutItem": [],
    "additionalInfo": [
      "❥ The Fashionable Design Makes You More Attractive, So You Can Let Your Fashion And Beauty  In Front Of Your Family And Friends At Christmas And Show Your Unique Charm",
      "casual summer dresses for women for women womens mini dress long sleeve dress dress for christmas party for women engagement party dresses for women womans dresses summer dresses for womens summer work dresses for women long summer dress for women cheap wrap dress short black polka dot summer dress maxi beach dresses for women summer womens coctail dress for fall elegant short dresses for women evening party summer date outfits women dresses summer maxi long maxi summer dresses",
      "summer dresses for women 2023 short dress for women casual white dresses for bridal shower by water tshirt dresses for women casual summer dress for women casual tall wedding dress size 8 women women maxi dress large mini bodycon dress long sleeve trendy summer dresses for women 2023 womens maxi dresses sparkle dress womens mini dresses fashion off shoulder floral dresses for women summer small summer dress bodycon work dresses for women summer dresses with pocketsfor women short",
      "beach dress for wedding guest clothes for women dress tank top dress for women summer long sun dresses women for love & lemons jewelry drees for womens summer classy resort wear for women 2023 tight dresses for women summer summer dresses for women maxi beach tan sun dress love and lemons dresses for women womens beach sundress cocktail dresses short for women evening party embroidered dress for women summer dreasea for bexh tie waist dresses for women casual summer sleeveless",
      "women s summer dress sleeve bodycon dress for women dresses for tall women party cotton sundress maxi summer dresses women summer casual women's easter dresses floral dresses with sleeves for women 2023 maxi for women dress summer the little black dress t shirt dresses for women knee length christmas outfits for women party vestido mujer playa sun dresses women short casual beach sundresses womens resort wear dresses tropical dress wedding party for women ruched dress for women"
    ],
    "productTable": {}
  },
  {
    "id": "B09GKT57PY",
    "url": "https://www.amazon.com/dp/B09GKT57PY?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "HOMISY Men's Fashion Hoodies & Sweatshirts,3D Print Hoodies Pullover Sweatshirt Hooded Coat with Pocket Winter Warm Pullover",
    "brand": "Homisy",
    "manufacturerName": null,
    "shortDescription": "////⚪ ⚫ 【Attention】Please Focus on Our Store.❤️o(*￣︶￣*)o❤️☀️-More detail, please contact us and we promise to help you to Answer and Resolve the problem ASAP.////⚪ ⚫ 【Description】🍁1.Features: Casual Tops,Prints,Casual T-shirt,Round Necks,Fashionable T-shirts,Long Sleeves,Pullover T-Shirts ,Casual tops, Casual Wear,Fashionable and fashionable designs. Please refer to our own size chart and  you can find it in our pictures or from the description.Size: S Size: Small ——US: 4 ——UK: 8 EU: 34 ——Bust: 100cm/39.37'' ——Length: 71cm/27.95'' ——Shoulder: 47cm/18.50'' ——Sleeve: 61cm/24.02'' Size: M Size: Medium ——US: 6 ——UK: 10 EU: 36 ——Bust: 106cm/41.73'' ——Length: 73cm/28.74'' ——Shoulder: 48cm/18.90'' ——Sleeve: 62cm/24.41'' Size: L Size: Large ——US: 8 ——UK: 12 EU: 38 ——Bust: 112cm/44.09'' ——Length: 75cm/29.53'' ——Shoulder: 49cm/19.29'' ——Sleeve: 63cm/24.80'' Size: XL Size: X-Large ——US: 10 ——UK: 14 EU: 40 ——Bust: 118cm/46.46'' ——Length: 77cm/30.31'' ——Shoulder: 51cm/20.08'' ——Sleeve: 64cm/25.20'' Size: XXL Size: 2X-Large ——US: 12 ——UK: 16 EU: 42 ——Bust: 124cm/48.82'' ——Length: 77cm/30.31'' ——Shoulder: 53cm/20.87'' ——Sleeve: 64cm/25.20'' Size: XXXL Size: 3X-Large ——US: 14 ——UK: 18 EU: 44 ——Bust: 130cm/51.18'' ——Length: 79cm/31.10'' ——Shoulder: 56cm/22.05'' ——Sleeve: 65cm/25.59''",
    "specifications": [
      {
        "key": "Fabric Type",
        "value": "❦choose one size or two size larger than you usual size,Pay attention to the size chart❦"
      },
      {
        "key": "Care Instructions",
        "value": "Halloween Clearance Sale !"
      },
      {
        "key": "Origin",
        "value": "❦Made in The USA and 7-12 Days Delivery❦"
      },
      {
        "key": "Fur Description",
        "value": "❦ breathable, Easy-drying, will keep you Warm❦"
      },
      {
        "key": "Country of Origin",
        "value": "USA"
      }
    ],
    "specifications_b": [
      {
        "key": "Fabric Type",
        "value": "❦choose one size or two size larger than you usual size,Pay attention to the size chart❦"
      },
      {
        "key": "Care Instructions",
        "value": "Halloween Clearance Sale !"
      },
      {
        "key": "Origin",
        "value": "❦Made in The USA and 7-12 Days Delivery❦"
      },
      {
        "key": "Fur Description",
        "value": "❦ breathable, Easy-drying, will keep you Warm❦"
      },
      {
        "key": "Country of Origin",
        "value": "USA"
      }
    ],
    "aboutItem": [],
    "additionalInfo": [
      "【🌱❣】Mens Casual Slim Fit Pullover Sweaters Knitted Turtleneck Designed Perfect Slim Fit V Neck Sweaters for Men | Lightweight Breathable Mens Sweater Men Sweater,Slim Zipper,Polo Sweater Casual Long Sleeve and Pullover with Ribbing Mens Striped Pullover Sweater Crewneck Contrast Fine Knitted Sweaters Men's Fashion Shawl Collar Pullover Casual Long Sleeve Knitted Sweater Mens Casual Slim Fit Pullover Sweaters Long Sleeve Knitted Fabric Zip Up Mock Neck Polo",
      "【🌱❣】Men's 100% Cotton Rib Knit Turtleneck Sweater weaters for Men,V Neck Slim Comfortably,Knitted Long Sleeve Men's Long-Sleeve Soft Touch Turtleneck Sweater Youth Men Cows Vintage Winter Sweaters Pullover Mens O-Neck Korean Fashions Sweater Men Long Sleeve Thermal Underwear Sweater Mock Turtleneck Base Layer Shirt Men's Supersoft Long-Sleeve Cable Knit Crewneck Sweater Slim Fit 1/4 Quarter Zip Pullover Men | Durable Wash Friendly Mens Sweater Men's Fisherman Irish Rib Crew Neck Sweater",
      "【🌱❣】Men’s Cashmere Wool Blend Relaxed Fit V Neck Pullover Sweater Mens Knitted Pullover Sweater Cable Knit Jumper Stylish Knitwear Lightweight Men's Casual Turtleneck Sweaters Cable Knit Thermal Pullover Sweater Men's Crew Neck Sweater Men's Cotton Cardigan Sweater Mens Long Sleeve Draped Lightweight Open Front Longline Hooded Cardigan Men's Soft Cotton Shawl Cardigan Mens Long Cardigan Open Front Draped Lightweight Hooded Sweater Men's Lightweight Ruffle Shawl Collar Cardigan",
      "【🌱❣】Mens Draped Cardigans Long Sleeve with Hooded Pockets Long Shawl Ruffle Mens Casual Slim Fit Cardigans V-Neck Basic Designed Long Sleeve Button Down Mens African Print Ruffle Shawl Collar Cardigan Lightweight Long Men's Lightweight Merino Wool Cardigan Sweater Mens Cable Knit Cardigan Sweater Shawl Collar Loose Fit Long Sleeve Casual Cardigans Men's Cardigan Sweaters Full Zip Up Stand Collar Slim Fit Casual Knitted Men's Supersoft Shawl Collar Cable Knit Cardigan Sweater",
      "【🌱❣】Men's Casual Cardigan Sweaters Slim Fit Knitted Full Zip Sweater with Pockects Men's Shawl Collar Open Front Long Cardigan Ribbed Knit Sweater with Pockets Mens 1950s Letterman Cardigan Sweater Men's Luxury Design Print Cardigan Shawl Casual Cardigan Short Sleeve Drape Cape Men's Shawl Casual Cardigan Long Sleeve Drape Cape Lightweight Open Front Men Long Cardigan Loose Open Front Ruffle Shawl Collar Drape Cape Vintage Men's Classic Soft Knitted Cardigan Sweaters"
    ],
    "productTable": {}
  },
  {
    "id": "B0C679L4W1",
    "url": "https://www.amazon.com/dp/B0C679L4W1?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "Portable Hand Held Steamer 1 Set Hand Held Ironing Machine Portable Steam Iron Travel Steam Iron Mini Travel Iron Dry and Wet Garment Electric Iron Electric Iron Steamer Abs Pink",
    "brand": "Veemoon Store",
    "manufacturerName": null,
    "shortDescription": "Package List 1 x Ironing Machine 1 x Heat Insulated Pad 1 x Specification Features -Preheating time: 30s handheld steamer. -Rated voltage: 110V Electric Garment Steamer. -Material: ABS Clothes Iron Steamer. -Power :30W mini iron -Water tank capacity: 60ml Electric Iron Steamer. - Our product is , high performance but price is more reasonable portable hand held steamer. - Preferred materials, good material, they are safe, and practical Handheld Electric Iron. - This household handheld iron is very easy to use, giving you much convenience clothing heat press. - The product is in a simple design, but it is very useful and practical Garment Steaming Iron. - The excellent workmanship of our product will bring you a good using experience steamer for clothes.Goods Informationsmall steam iron The perfect performance of this household handheld iron will give you an excellent use experience.Electric Flatiron Note: This item comes with US plug, please confirm the voltage of your area before purchasing.mini steamer The handheld ironing machine is in a simple design, but it is very useful and practical.Clothes Iron Steamer Made of material, it is and safe for lasting use",
    "specifications": [
      {
        "key": "Brand",
        "value": "Veemoon"
      },
      {
        "key": "Color",
        "value": "Pink"
      },
      {
        "key": "Item Weight",
        "value": "270 Grams"
      },
      {
        "key": "Style",
        "value": "centimeter"
      },
      {
        "key": "Wattage",
        "value": "30 watts"
      }
    ],
    "specifications_b": [],
    "aboutItem": [
      "HAND HELD STEAMER-- ?????Professional steam technology no leaking, no spilling, allows you to steam your clothes any way you want hanging vertically or lying horizontally.",
      "MINI HEAT PRESS MACHINE-- It is smooth and a cover more area can be shaped quickly after spraying with water mist without damaging your clothes.",
      "TRAVEL CLOTHES-- The effectively handheld garment steamer powers continuous minutes of soothing steam.",
      "PORTABLE STEAM IRON FOR CLOTHES-- Can produce intense steam, not effectively remove wrinkles on different kinds of fabrics, but also level up your living style.",
      "GARMENT CLOTHES STEAMER-- You can buy it as a gift to friends and families. These accessories are very practical for them."
    ],
    "additionalInfo": [],
    "productTable": {
      "Product Dimensions": "7.87 x 5.31 x 1.97 inches",
      "Item Weight": "9.5 ounces",
      "ASIN": "B0C679L4W1",
      "Item model number": "V433619TBDL04L9L",
      "Date First Available": "May 24, 2023",
      "Voltage": "691 Volts",
      "Capacity": "60 Milliliters"
    }
  },
  {
    "id": "B099D9L5MW",
    "url": "https://www.amazon.com/dp/B099D9L5MW?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "Pacon® Multi-Program Handwriting Tablet, D'Nealian/Zaner-Bloser, 5/8\" x 5/16\" x 5/16\" Ruled Long, 10-1/2\" x 8\", 40 Sheets, Pack of 12",
    "brand": "PACON",
    "manufacturerName": "DIXON TICONDEROGA CO - PACON",
    "shortDescription": "Our Pacon® Multi-Program Handwriting Papers offer rulings that conform to both the Zaner-Bloser™ (Grade 1) and D'Nealian™ (Grade K) handwriting programs. Bright tablet paper ruled both sides with red baselines, blue dotted midlines and blue headlines. Tablets have a heavy chipboard back and protective full page, four color, retail-friendly front cover. Recyclable. Ruling: 5/8\" (long way). Dotted Midline: 5/16\". Skip Space: 5/16\". Includes 40 sheets. Measures 10.5\" x 8\". Sold as a pack of 12 tablets.",
    "specifications": [],
    "specifications_b": [],
    "aboutItem": [
      "Ruled both sides with red baselines, blue dotted midlines and blue headlines",
      "Each tablet measures 10-1/2\" x 8\"",
      "D'Nealian Grade K / Zaner-Bloser Grade 1"
    ],
    "additionalInfo": [],
    "productTable": {
      "Manufacturer": "DIXON TICONDEROGA CO - PACON",
      "Brand": "PACON",
      "Item Weight": "3.96 pounds",
      "Package Dimensions": "10.5 x 8 x 3 inches",
      "Item model number": "PAC2480-12",
      "Material Type": "Paper",
      "Manufacturer Part Number": "PAC2480-12"
    }
  },
  {
    "id": "B08BLGVK4W",
    "url": "https://www.amazon.com/dp/B08BLGVK4W?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "MIPPER Pixie Cut Wig for White Women Synthetic Hair Gray Gradient Silver Short Straight Wig for Daily Halloween Party Fancy Dress",
    "brand": "MIPPER",
    "manufacturerName": "MIPPER",
    "shortDescription": "Gradient color short straight pixie cut wig with bangs Style:Europe and America Hair length:about 11 inch/28 cm Hair color:as the picture show Hair material:matte high temperature silk,more natural and realistic Sex:female Weight:150 grams Can not be permed or dyed Package includes:1pcs*wig,1pcs*mesh wig cap  How to adjust the wig cap size There are two straps with hook inside the wig cap,the back of wig cap has some grid,you can adjust the hook into the different grids to correct size to suit your head  Warm tips: 1.All wigs will shed slightly especially when you wear for the first time, which is normal 2.Due to the effect of light,computer monitor's color setting or other reasons,the color maybe be a little different on the photos,this is inevitable,please excuse me",
    "specifications": [
      {
        "key": "Material",
        "value": "Synthetic"
      },
      {
        "key": "Hair Type",
        "value": "Straight"
      },
      {
        "key": "Style",
        "value": "Straight"
      },
      {
        "key": "Brand",
        "value": "MIPPER"
      },
      {
        "key": "Age Range (Description)",
        "value": "Adult"
      }
    ],
    "specifications_b": [],
    "aboutItem": [
      "1*Short straight pixie cut wig+1*free mesh wig cap",
      "Material:100% high temperature fiber,natural looking and soft touching,120-180 degrees high temperature resistance",
      "Simulation scalp design,rose inner net,skin-friendly and breathable,more comfortable and natural to wear",
      "Wig cap size:adjustable,suitable for 20.5-22.8 inch head circumference",
      "Suitable for daily use,theme party,cosplay,Halloween,costume,concert,holiday,fancy dress etc."
    ],
    "additionalInfo": [],
    "productTable": {
      "Package Dimensions": "8 x 6 x 1 inches; 5.29 Ounces",
      "Item Weight": "5.3 ounces",
      "Manufacturer": "MIPPER",
      "ASIN": "B08BLGVK4W"
    }
  },
  {
    "id": "B0B31JX1YW",
    "url": "https://www.amazon.com/dp/B0B31JX1YW?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "MagiDeal Kitchen Drawer Organizer Tray Cutlery Drawer Dividers Tray Stationery Makeup Caddy Multi Use Compartments for Serving Utensils Bathroom, Small",
    "brand": "MagiDeal",
    "manufacturerName": "MagiDeal",
    "shortDescription": "Description: - Kitchen Drawer Storage Organizer Tray: These drawer organizer can be used separately divide in different drawers, separatable and expandable to meet your all cutlery, right dimensions all your silverware neatly and comfortably. - Premium quality: Kitchen cutlery drawer organizer made of high plastic material, washable, smooth surface, thick and durable, not easy to deform. - Compartments Divider: With 2 compartment plate, adjustable and sort place setting pieces, , forks, spoons, spatulas, whisks, utensils and other kitchen gadgets, all your silverware neatly, and save space. - Multi Use: These organizer divider storage tray can storage baby products, clothes, tableware, toys, toiletry storage, underwear, makeup, snack, stationery and other sundries. - Home Organization Solution: These cabinet drawer storage organizer tray perfectly fits large drawers, offer a generous capacity for your sundries customize your drawer layout.Specification: - Material:PlasticSize Chart:Large Size:34.6x12x5cm/13.62x4.72x1.97inchSmall Size:34.6x8x5cm/13.62x3.15x1.97inch&;Package Includes:1 Piece Kitchen&;Drawer Organizer Tray2 Pieces&;Compartment Plate",
    "specifications": [
      {
        "key": "Specific Uses For Product",
        "value": "Stationery"
      },
      {
        "key": "Material",
        "value": "Plastic"
      },
      {
        "key": "Special Feature",
        "value": "Expandable"
      },
      {
        "key": "Color",
        "value": "Small"
      },
      {
        "key": "Brand",
        "value": "MagiDeal"
      },
      {
        "key": "Mounting Type",
        "value": "Insert Mount"
      },
      {
        "key": "Number of Compartments",
        "value": "2"
      },
      {
        "key": "Number of Items",
        "value": "1"
      }
    ],
    "specifications_b": [],
    "aboutItem": [
      "Kitchen Drawer Storage Organizer Tray: These drawer organizer can be used separately divide in different drawers, separatable and expandable to meet your all cutlery, right dimensions all your silverware neatly and comfortably.",
      "Premium quality: Kitchen cutlery drawer organizer made of high plastic material, washable, smooth surface, thick and durable, not easy to deform.",
      "Compartments Divider: With 2 compartment plate, adjustable and sort place setting pieces, , forks, spoons, spatulas, whisks, utensils and other kitchen gadgets, all your silverware neatly, and save space.",
      "Multi Use: These organizer divider storage tray can storage baby products, clothes, tableware, toys, toiletry storage, underwear, makeup, snack, stationery and other sundries.",
      "Home Organization Solution: These cabinet drawer storage organizer tray perfectly fits large drawers, offer a generous capacity for your sundries customize your drawer layout."
    ],
    "additionalInfo": [],
    "productTable": {
      "Manufacturer": "MagiDeal",
      "Part Number": "0579094480002USB",
      "Item Package Quantity": "1",
      "Special Features": "Expandable"
    }
  },
  {
    "id": "B005J9CE10",
    "url": "https://www.amazon.com/dp/B005J9CE10?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "BIDDEFORD BLANKETS Comfort Knit Electric Heated Blanket with Analog Controller, Full, Blue",
    "brand": "Biddeford Blankets Store",
    "manufacturerName": "Biddeford Blankets",
    "shortDescription": "Biddeford Blankets luxuriously soft Comfort Knit Fleece electric heated warming blanket. Constructed with ultra-thin wires for added comfort. Should you get too cozy and nod off. Machine wash and dry. Five year manufacturer's warranty. Twin Size (single controller) 62\" X 84\" Full Size (single controller) 72\" X 84\" Queen Size (Dual controllers) 84\" X 90\" King Size (Dual controllers) 100\" X 90\"",
    "specifications": [
      {
        "key": "Material",
        "value": "Polyester"
      },
      {
        "key": "Color",
        "value": "Blue"
      },
      {
        "key": "Brand",
        "value": "Biddeford Blankets"
      },
      {
        "key": "Special Feature",
        "value": "Adjustable"
      },
      {
        "key": "Style",
        "value": "Modern"
      },
      {
        "key": "4.4",
        "value": "Light weight"
      },
      {
        "key": "4.3",
        "value": "Softness"
      },
      {
        "key": "4.3",
        "value": "Easy to use"
      },
      {
        "key": "4.1",
        "value": "Giftable"
      },
      {
        "key": "3.8",
        "value": "Temperature Control"
      },
      {
        "key": "3.0",
        "value": "Durability"
      },
      {
        "key": "5,277 global ratings",
        "value": "4.3"
      }
    ],
    "specifications_b": [],
    "aboutItem": [
      "100% Polyester",
      "Imported",
      "FULL SIZE: SOFT AND COMFORTABLE – Never climb into cold sheets again Electric Heated Blanket in ultra soft comfortable comfort knit fleece fabric Twin and Full size include 1 controller Queen and King size include 2 controllers 100 Polyester",
      "THERAPEUTIC FULL BODY RELIEF WITH ADJUSTABLE HEAT SETTINGS – The cozy fleece blanket has ultra-thin heating wires for added comfort The Digital Controller Includes Auto-off and 10 heat settings",
      "SAFETY - All Biddeford Blankets are tested and approved by a 3rd party (UL or ETK Intertek) to comply with industry safety standards",
      "MACHINE WASHABLE and EASY CARE – The blanket is machine washable and dryer safe for your convenience Make sure to disconnect and remove controllers before washing Do not use an extension cord or power strip for these blankets",
      "WARRANTY - 5 year limited manufacturer's warranty"
    ],
    "additionalInfo": [],
    "productTable": {
      "Item Weight": "4 Pounds",
      "Manufacturer": "Biddeford Blankets",
      "ASIN": "B005J9CE10",
      "Item model number": "1001-903192-535",
      "Is Discontinued By Manufacturer": "No",
      "Warranty Description": "5-Year limited warranty",
      "Batteries required": "No",
      "Import": "Imported",
      "Blanket Form": "Comforter",
      "Age Range (Description)": "Adult",
      "Product Dimensions": "12.2\"L x 4.3\"W",
      "Theme": "Plain",
      "Pattern": "Solid",
      "Recommended Uses For Product": "Home",
      "Seasons": "Winter",
      "Product Care Instructions": "Machine Wash",
      "Size": "Full",
      "Fabric Type": "100% Polyester",
      "Number of Items": "1",
      "Included Components": "User Guide Manual, Includes (1) Biddeford Blankets Comfort Knit Electric Heated Blanket With Analog Controller"
    }
  },
  {
    "id": "B07MNSLX8K",
    "url": "https://www.amazon.com/dp/B07MNSLX8K?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "MINGPINHUIUS 4-in-1 Multifunction Electric Cooker Skillet Wok Electric Hot Pot For Cook Rice Fried Noodles Stew Soup Steamed Fish Boiled Egg Small Non-stick with Lid (2.8L, with Steamer)",
    "brand": "MINGPINHUIUS Store",
    "manufacturerName": null,
    "shortDescription": null,
    "specifications": [
      {
        "key": "Brand",
        "value": "MINGPINHUIUS"
      },
      {
        "key": "Capacity",
        "value": "2.8 Liters"
      },
      {
        "key": "Power Source",
        "value": "Corded Electric"
      },
      {
        "key": "Color",
        "value": "With Steamer"
      },
      {
        "key": "Special Feature",
        "value": "See-Through Lid, Automatic Shut Off, Non-Stick"
      },
      {
        "key": "4.4",
        "value": "Light weight"
      },
      {
        "key": "4.3",
        "value": "Easy to clean"
      },
      {
        "key": "4.2",
        "value": "Easy to use"
      },
      {
        "key": "3.6",
        "value": "Temperature Control"
      },
      {
        "key": "345 global ratings",
        "value": "4.0"
      }
    ],
    "specifications_b": [],
    "aboutItem": [
      "Healthy cooking: Food grade materials, safe, stable, non-toxic. The inner layer is made of healthy 304 stainless steel. Tao Jing non-stick coating: non-stick pan, cleaning is simpler.",
      "Safe automatic shutdown: No need to worry when cooking. The anti-drying is automatically turned off when the water is dry. Very convenient pot to cook for students.",
      "PP anti-scalding handle: Easy to grip, comfortable to touch, will not fall, effective heat insulation and anti-scalding.",
      "Save time: The Electric skillet has fast and slow two heating modes, easy to operate. At the same time, you can use the steaming and boiling method to save you time.",
      "Multi-Functions: cooked, boiled, braised, stewed, steamed. The transparent glass lid allows you to observe the food maturity at any time during the cooking process. The bottom of the pot is evenly heated and the food is more delicious."
    ],
    "additionalInfo": [],
    "productTable": {
      "Package Dimensions": "9.92 x 9.76 x 6.06 inches",
      "Item Weight": "2.73 pounds",
      "ASIN": "B07MNSLX8K",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 26, 2018",
      "Material": "Stainless Steel",
      "Lid Material": "glass,stainless steel",
      "Wattage": "600 watts",
      "Included Components": "Adaptor, Glass lid, Instruction Manual",
      "Voltage": "110 Volts",
      "Model Name": "electric hot pot"
    }
  },
  {
    "id": "B0BJD3M56S",
    "url": "https://www.amazon.com/dp/B0BJD3M56S?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "FONTOI 2 in 1 Full Mattress, 6 inch Memory Foam Mattress, Medium Firm Bed Mattress with Cover, Pressure Relieving Mattress for Kid/Adult (White)",
    "brand": "FONTOI Store",
    "manufacturerName": null,
    "shortDescription": "2 in 1 Full Mattress, 6 inch Memory Foam Mattress, Medium Firm Bed Mattress with Cover, Pressure Relieving Mattress for Kid/Adult",
    "specifications": [
      {
        "key": "Size",
        "value": "Full"
      },
      {
        "key": "Special Feature",
        "value": "Made in USA"
      },
      {
        "key": "Item Firmness Description",
        "value": "Medium Firm"
      },
      {
        "key": "Fill Material",
        "value": "FONTOI"
      },
      {
        "key": "Brand",
        "value": "75\"L x 54\"W x 6\"Th"
      },
      {
        "key": "Product Dimensions",
        "value": "Tight Top"
      },
      {
        "key": "Top Style",
        "value": "White"
      },
      {
        "key": "Color",
        "value": "Adult"
      },
      {
        "key": "Age Range (Description)",
        "value": "Mattress Memory Foam"
      }
    ],
    "specifications_b": [],
    "aboutItem": [],
    "additionalInfo": [],
    "productTable": {
      "Item Weight": "21 Pounds",
      "Product Dimensions": "75 x 54 x 6 inches",
      "Item model number": "6INW-2IN1-6F",
      "Construction Type": "Memory Foam",
      "Product Care Instructions": "Hand Wash Only"
    }
  },
  {
    "id": "B000NNCQ2E",
    "url": "https://www.amazon.com/dp/B000NNCQ2E?th=1&psc=1",
    "url_status": "200",
    "type": "product",
    "name": "Prevail Adult Incontinence Underwear for Men & Women, Maximum Absorbency, Youth/Small, 22 Count (Pack of 4)",
    "brand": "Prevail Store",
    "manufacturerName": "First Quality Consumer Products LLC",
    "shortDescription": "Designed for extra leakage protection, Prevail Underwear features Comfort-Shape Plus with gentle elastics that shape to your body for a more comfortable and discreet fit than standard adult diapers. The cloth-like outer cover is soft and comfortable for all-day wear while ventilated waist panels allow air to pass through, reducing heat buildup and promoting healthy skin. Each product is constructed with a discreet core technology that allows for thinner, highly-absorbent material that enables the user to move more freely and confidently. Combined with a super absorbent polymer for dual protection, Odor Guard technology is proven to reduce the total amount of odor-causing ammonia formed during and after use. Moisture is quickly locked in upon contact for added leakage protection while the soft outer fabric provides additional all-day comfort. Youth/Small Adult size fits waist sizes 20 to 34 inches for a snug and comfortable fit. Each Prevail incontinence product features a proprietary Quick Wick layer of material with MaxSoft Technology that provides advanced softness with rapid liquid absorption for optimal product performance. This package includes four packs of underwear with 22 pairs per package for a total of 88 individual pairs of disposable underwear. Prevail adult care products are manufactured in Pennsylvania with attention to quality, safety, sustainability, and responsible sourcing practices by First Quality, a family-owned company. First Quality is a leader in developing premium quality products. In addition to our collection of adult care products, we also offer lines of baby products, feminine care, paper products, and bottled water.",
    "specifications": [
      {
        "key": "Brand",
        "value": "$48.79"
      },
      {
        "key": "Number of Items",
        "value": "$50.10"
      },
      {
        "key": "Color",
        "value": "$40.72"
      },
      {
        "key": "Incontinence Protector Type",
        "value": "$139.61"
      },
      {
        "key": "Age Range (Description)",
        "value": "Compare New (3) from"
      },
      {
        "key": "3,967 global ratings",
        "value": "Prevail"
      }
    ],
    "specifications_b": [],
    "aboutItem": [
      "Please confirm the size before purchasing. Inapproriate size may lead to leakage issue or can cause rashes\"",
      "COOL COMFORT: Skin Smart Fabric helps protect skin with vitamin E, aloe & chamomile. Breathable Zones allow air flow to help skin stay cool, & cloth-like outer cover is silky soft & comfortable.",
      "RELIABLE & DISCREET BLADDER LEAKAGE PRODUCTS: We offer discreet & comfortable protection with underwear, pads, briefs, bed pads, & belted shields for adult incontinence & post-partum bladder leakage.",
      "COMFORT & INNOVATION: We spent decades working with users & healthcare professionals to develop adult diapers & incontinence underwear that offer discreet comfort & absorbency & support skin health.",
      "TRY OUR QUALITY: Prevail is a leader in advancing new technologies for greater protection, comfort, skin health & wellness. Our commitment to quality & innovation is evident in every product we make."
    ],
    "additionalInfo": [],
    "productTable": {
      "Product Dimensions": "19.07 x 10.75 x 6.13 inches; 2.15 Pounds",
      "Item Weight": "2.15 Pounds",
      "Department": "Unisex Adult",
      "Manufacturer": "First Quality Consumer Products LLC",
      "ASIN": "B000NNCQ2E",
      "Country of Origin": "USA",
      "Item model number": "10090891500007",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 27, 2004",
      "Material": "Polypropylene",
      "Material Type Free": "Latex Free",
      "Reusability": "Disposable",
      "Size": "Small (Pack of 1)",
      "Unit Count": "88 Count",
      "Pattern": "Solid",
      "Recommended Uses For Product": "Fecal Protection, Urine Protection, Adult Diapers",
      "Target Audience": "Women, Men, Unisex-Youth, Unisex-Adults",
      "Item Dimensions LxWxH": "19.07 x 10.75 x 6.13 inches",
      "Lining Description": "Cotton",
      "Incontinence protector size": "Small",
      "Weight Range": "85-120 lbs"
    }
  }
]