[
    {
        "id": "1765107876",
        "url": "https://www.walmart.com/ip/1765107876?selected=true",
        "url_status": "200",
        "type": "Chicken Coops",
        "name": "Outdoor Wooden Chicken Coop for 2-3 Chickens Hen House 67\" Poultry Cage w/ Ramp and Nesting Box",
        "brand": "ECOLINEAR",
        "manufacturerName": "ECOLINEAR",
        "shortDescription": [
            "This chicken coop is for those who simply want to upgrade their backyard garden, keeping chickens has became the new craze with the Chicken coops you can give them a home of their own that is both stylish and functional",
            "A large inside area and extra run cage give the animals more space to move around",
            "Besides, the nesting box can hold two chickens at the same time, it is perfect for chicken to lay eggs in"
        ],
        "specifications": [
            {
                "key": "Features",
                "value": "Waterproof"
            },
            {
                "key": "Brand",
                "value": "ECOLINEAR"
            },
            {
                "key": "Manufacturer",
                "value": "ECOLINEAR"
            },
            {
                "key": "Animal Type",
                "value": "Chicken"
            },
            {
                "key": "Color",
                "value": "Brown"
            },
            {
                "key": "Assembled Product Weight",
                "value": "67 lb"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "67.50 x 24.00 x 40.50 Inches"
            }
        ],
        "additionalInfo": [
            "This chicken coop is for those who simply want to upgrade their backyard garden, keeping chickens has became the new craze with the Chicken coops you can give them a home of their own that is both stylish and functional. A large inside area and extra run cage give the animals more space to move around. Besides, the nesting box can hold two chickens at the same time, it is perfect for chicken to lay eggs in.",
            "ã\u0080\u0090Waterproof Roofã\u0080\u0091for extra resistance and protection from outdoor elements, chicken coop will keep the animals dry and safe in most rainy days. ã\u0080\u0090Removable Trayã\u0080\u0091rabbit hutch comes with a removable bottom sliding tray for easy cleaning. ã\u0080\u0090Egg Collection Boxã\u0080\u0091The chicken coop is equipped with an egg box, easy way to deposit and collect eggs. ã\u0080\u0090Wire Fencingã\u0080\u0091is vital to the ventilation of chicken coops, it will also protect your animals from outside predators. ã\u0080\u0090Easy Access Rampã\u0080\u0091Ladder of the chicken run gives easy access to enter the raised housing area, with timber ridges above the ramp to protects your poultry from slipping back. "
        ]
    },
    {
        "id": "1236350889",
        "url": "https://www.walmart.com/ip/1236350889?selected=true",
        "url_status": "200",
        "type": "Sweatpants",
        "name": "Inleife Mens Plus Size Sweatphants Pants Clearance Men's Pants Sweatpants Pant Hip-hop Pants Legging Padded Casual Plus Size Pants",
        "brand": "Inleife",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "Full Long Pants for Men clearance"
            },
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "2XL"
            },
            {
                "key": "Fabric Content",
                "value": "95% Polyester"
            },
            {
                "key": "Brand",
                "value": "Inleife"
            },
            {
                "key": "Gender",
                "value": "Male"
            },
            {
                "key": "Color",
                "value": "Dark Gray"
            }
        ],
        "additionalInfo": [
            "Men's Pants Pants Sweatpants Hip-hop Pants Legging Padded Casual Pants   Item specifics   1. You will feel comfortable all day. Moreover, this Pants is non-irritating.   2. This Pants features drawstring banded waistband. It also guarantees a   as it is made of high-quality and eco-friendly bamboo fiber.   3. High elasticity, no movement.   4. Your best sports companion.   5. Pocket design for easy mobile phone   Gender:Men  Season:Spring, Autumn, Winter Occasion:Sport or daliy Material:Polyester Pant Style:Pants, Tights, Leggings  Pattern Type:Adjustable Waist, Ankle Length, Breathable, Drawstring,  Elastic Waist, Insulated, Stretch, Wind Resistant, Wrinkle Resistant  Package include:1PC Sweatpants   Size: S Waist: 74cm/29.13'' Length: 100cm/39.37'' Hip: 108cm/42.52''  Size: M Waist: 80cm/31.50'' Length: 102cm/40.16'' Hip: 114cm/44.88''  Size: L Waist: 86cm/33.86'' Length: 104cm/40.94'' Hip: 120cm/47.24''  Size: XL Waist: 92cm/36.22'' Length: 106cm/41.73'' Hip: 126cm/49.61''  Size: XXL Waist: 98cm/38.58'' Length: 108cm/42.52'' Hip: 132cm/51.97''  Size: XXXL Waist: 104cm/40.94'' Length: 110cm/43.31'' Hip: 138cm/54.33''",
            " Inleife Mens Plus Size Sweatphants Pants Clearance Men's Pants Sweatpants Pant Hip-hop Pants Legging Padded Casual Plus Size Pants Men's autumn and winter Long pants Comfortable and breathable materials always protect your skin In many sizes and colors, there is always one for you Suitable for home, travel and party "
        ]
    },
    {
        "id": "1219886074",
        "url": "https://www.walmart.com/ip/1219886074?selected=true",
        "url_status": "200",
        "type": "Automotive Organizers",
        "name": "ZFITEI 2 Pack Backseat Car Organizer, 10 Storage Pockets Car Organizers and Storage with Touch Screen Tablet Holder, Heavy Duty Waterproof and Stain Resistant Kick Mats Back Seat Protector for Kids",
        "brand": "ZFITEI",
        "manufacturerName": null,
        "shortDescription": [
            "2 Pack Backseat Car Organizer, 10 Storage Pockets Car Organizers and Storage with Touch Screen Tablet Holder, Heavy Duty Waterproof and Stain Resistant Kick Mats Back Seat Protector for Kids"
        ],
        "specifications": [
            {
                "key": "Brand",
                "value": "ZFITEI"
            },
            {
                "key": "Color",
                "value": "Black"
            }
        ],
        "additionalInfo": [
            "2 Pack Backseat Car Organizer, 10 Storage Pockets Car Organizers and Storage with Touch Screen Tablet Holder, Heavy Duty Waterproof and Stain Resistant Kick Mats Back Seat Protector for Kids",
            " ORGANIZE YOUR STUFF - 24x16 inches in size, extra long straps with quick-release buckles ensure a perfect fit for any car; Car organizers, not only will your belongings be at your fingertips while traveling, but you can forget about the mess on the backs of the front seats - they'll be neat and clean from now on. PLENTY OF STORAGE COMPARTMENTS - Made of improved strong 600D polyester, waterproof frosted PVC, durable, safe and reliable; The rear seat car organizer has 10 different sized compartments, including a clear tablet holder, water bottle pockets, and a large mesh pocket for other essentials. TRANSPARENT TABLET STAND - Our rear seat car organizer bag comes with a clear tablet stand that will keep your kids entertained and make it easy for them to touch the screen. VERY DURABLE - Waterproof, machine washable fabric, easy for you to clean muddy footprints, suitable for traveling, children. EASY TO INSTALL - Car footrests with adjustable straps are suitable for all types of vehicles and can be simply installed to store different items in the car while keeping the space organized. "
        ]
    },
    {
        "id": "2189334404",
        "url": "https://www.walmart.com/ip/2189334404?selected=true",
        "url_status": "200",
        "type": "Athletic Outfit Sets",
        "name": "Aislor Girls Cheer Leader Uniform Cheerleading Halloween Cosplay Outfits",
        "brand": "Aislor",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Clothing Size Group",
                "value": "Girls"
            },
            {
                "key": "Clothing Size",
                "value": "12"
            },
            {
                "key": "Color",
                "value": "Light Pink"
            },
            {
                "key": "Age Group",
                "value": "Child"
            },
            {
                "key": "Gender",
                "value": "Female"
            },
            {
                "key": "Brand",
                "value": "Aislor"
            }
        ],
        "additionalInfo": [
            "Set Include: 1Pc Crop Top, 1Pc SkirtCondition: New with tagMaterial: 70% Polyester, 20% Spandex, 10% Nylon    Tag No. Recommended Size Chest Tops Length Skirt Length Skirt Waist   6 6 21.5\"/55.5cm 9\"/23cm 11.5\"/29.5cm 19.5\"/50cm   8 8 23.5\"/60.5cm 9.5\"/24.5cm 12.5\"/32cm 21.5\"/55cm   10 10 25.5\"/65.5cm 10.5\"/26.5cm 13\"/34cm 23.5\"/60cm   12 12 27.5\"/70.5cm 11\"/28.5cm 14\"/36cm 25.5\"/65cm   14 14 29.5\"/75.5cm 12\"/30.5cm 15\"/38cm 27.5\"/70cm   16 16 31.5\"/80.5cm 12.5\"/32.5cm 15.5\"/40cm 29.5\"/75cm   ",
            " Made of high quality material, light weight, soft, breathable and comfortable for baby wearing. The crop top features with sleeveless and v neckline, letter “CHEER” print in the front. Matching with good elasticity waistband skirt, patchwork style design, no lining. Size Table means age ranges for girls, but they are for general guidance only, hand wash cold. Suitable for any occasion, dance, daily life, cheerleading, stage performance, competition and so on. "
        ]
    },
    {
        "id": "1664692920",
        "url": "https://www.walmart.com/ip/1664692920?selected=true",
        "url_status": "200",
        "type": "Bras",
        "name": "Push Up Plunge Strapless Sticky Adhesive Bra Deep U-Shaped Invisible Backless Bra for Women",
        "brand": "Heldig",
        "manufacturerName": "Heldig",
        "shortDescription": [
            "Push Up Plunge Strapless Sticky Adhesive Bra Deep U-Shaped Invisible Backless Bra for Women",
            "Natural silicone: skin-friendly adhesive, suitable for sensitive skin.",
            "Will make a sexy and natural deep v-shape breast for you.",
            "Reusable: sticky after washing, reusable.",
            "Invisiable bra: perfect for low-cut outfits or backless strapless dresses.",
            "The plunge bra creates the effect of deep “v”, thereby helps gather your chest and achieve full coverage to make a deep attractive.cleavage.",
            "This push up lift bra creates the appearance of increased cleavage.Get extra cleavage without the bra straps and say goodbye to all embarrassing occasions!",
            "Reusable bra, but too much sweat will affect stickiness, so the Silicone Push-up Adhesive Bra is not suitable for using in high temperature outdoors or doing exercise.Simply hand wash with running water after each use and air dry it.",
            "The U-design sticky bra is not recommended for using in high temperature outdoors or working due to too much sweat will affect the effectiveness of the adhesive, so you need wear clean before chest to make sure you don't use any body oil or lotion before sticking this to your skin or it won't stick at all.",
            "Use water or laundry detergent to gently glue the surface, and let it dry naturally and do not expose it to the sun. Then seal and store in a cool and dry place to prevent sticking dust.",
            "Clean your chest with mild soap and water.",
            "Remove the protective film from the bra.",
            "Stand in front of the mirror , press and hold contour cups to skin",
            "for several moments to to adhere cups to skin, to place breasts comfortably into contour cups",
            "Connect the two bra cups together with the front closure."
        ],
        "specifications": [
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "a"
            },
            {
                "key": "Brand",
                "value": "Heldig"
            },
            {
                "key": "Model",
                "value": "WMZY-769-1"
            },
            {
                "key": "Manufacturer",
                "value": "Heldig"
            }
        ],
        "additionalInfo": [
            "Product Description    Push Up Plunge Strapless Sticky Adhesive Bra Deep U-Shaped Invisible Backless Bra for Women    FEATURES    Natural silicone: skin-friendly adhesive, suitable for sensitive skin.   Will make a sexy and natural deep v-shape breast for you.   Reusable: sticky after washing, reusable.   Invisiable bra: perfect for low-cut outfits or backless strapless dresses.    Plunge Bra    The plunge bra creates the effect of deep “v”, thereby helps gather your chest and achieve full coverage to make a deep attractive.cleavage.    Push Up Bra    This push up lift bra creates the appearance of increased cleavage.Get extra cleavage without the bra straps and say goodbye to all embarrassing occasions!    Invisible Strapless Bra    Reusable bra, but too much sweat will affect stickiness, so the Silicone Push-up Adhesive Bra is not suitable for using in high temperature outdoors or doing exercise.Simply hand wash with running water after each use and air dry it.    WEARING NOTES&WASH TIPS    The U-design sticky bra is not recommended for using in high temperature outdoors or working due to too much sweat will affect the effectiveness of the adhesive, so you need wear clean before chest to make sure you don't use any body oil or lotion before sticking this to your skin or it won't stick at all.   Use water or laundry detergent to gently glue the surface, and let it dry naturally and do not expose it to the sun. Then seal and store in a cool and dry place to prevent sticking dust.    TIPS    Clean your chest with mild soap and water.   Remove the protective film from the bra.   Stand in front of the mirror , press and hold contour cups to skin   for several moments to to adhere cups to skin, to place breasts comfortably into contour cups   Connect the two bra cups together with the front closure.   ",
            " HIGH-QUALITY BREATHABLE FABRIC: Softness: Our adhesive bra are made up of high quality spandex and Lycra fabric, skin-friendly and comfortable.High-quality fabrics have good breath ability and are more refreshing.No static electricity, friction, no ball. DEEP U PLUNGE BRA DESIGN:Our U-shaped bra creates a busty,fuller and charming deep v shape breast; V shape design, fits for your breasts.The sticking is firm, the thickened side sticks help the sides to gather together. SUIITABLE FOR ALL OCCASIONS:The u-shaped design adhesive bra is prefect for daily wear and unique occasion dressing such us evening dress, wedding, slip dress, low cut dress, active wear, Christmas, leisure, cocktail, night scene and party, etc. WEARING NOTES:The U-design sticky bra is not recommended for using in high temperature outdoors or working due to too much sweat will affect the effectiveness of the adhesive, so you need wear clean before chest to make sure you don't use any body oil or lotion before sticking this to your skin or it won't stick at all. WASH TIPS:Use water or laundry detergent to gently glue the surface, and let it dry naturally and do not expose it to the sun. Then seal and store in a cool and dry place to prevent sticking dust. "
        ]
    },
    {
        "id": "1970062201",
        "url": "https://www.walmart.com/ip/1970062201?selected=true",
        "url_status": "200",
        "type": "Dresses",
        "name": "Pntutb Womens Plus Size Clearance,Summer Dresses For Women's Beach Floral Print Sleeveless Tank Swing Dress Black S",
        "brand": "PNTUTB",
        "manufacturerName": "Pntutb",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "Womens plus size clearance $5, Womens deals, Summer savings"
            },
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "S"
            },
            {
                "key": "Fabric Content",
                "value": "100% Polyester Spandex"
            },
            {
                "key": "Brand",
                "value": "PNTUTB"
            },
            {
                "key": "Gender",
                "value": "Female"
            },
            {
                "key": "Model",
                "value": "SLZX220822A0099"
            },
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Manufacturer",
                "value": "Pntutb"
            }
        ],
        "additionalInfo": [
            "Pntutb Womens Plus Size Clearance,Summer Dresses For Women's Beach Floral Print Sleeveless Tank Swing Dress Black S Gender: Women/Female/Girl   Season: Four seasons   Occasion: Daily   Style: Sexy, Fashion, Leisure   It is made of high quality materials, durable enought for your daily wearing.   I am sure you will like it!   This stylish casual women's clothing fits your body perfectly and makes you feel relaxed and comfortable.   If you have any questions about this products, please feel free to contact us. We will contact you within 24 hours to provide you with a better solution.   Garment care: Machine or hand wash with cold water, hang or line dry, no bleach. We love our customers and take pride in providing a pleasant shopping experience.   KEY1: Rollback and clearance clothes under 5$, Womens plus size clearance $5, Dresses for women 2022, Womens clearance under $10, Summer womens tops   KEY2: Womens shorts ,Womens pants, Lingerie for women, Bras for women, Gift",
            " Womens deals Womens plus size clearance $5 Dresses for women 2022 Womens clearance under $10 Summer womens tops "
        ]
    },
    {
        "id": "1307051717",
        "url": "https://www.walmart.com/ip/1307051717?selected=true",
        "url_status": "200",
        "type": "Sweatshirts & Hoodies",
        "name": "symoid Mens Sweatshirts & Hoodies 2022- Fall and Winter Unisex Hooded Sweater Printeding Pullover Blouse Dark Gray S",
        "brand": "Symoid",
        "manufacturerName": "symoid",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "discount"
            },
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "S"
            },
            {
                "key": "Brand",
                "value": "Symoid"
            },
            {
                "key": "Gender",
                "value": "Male"
            },
            {
                "key": "Manufacturer",
                "value": "symoid"
            },
            {
                "key": "Color",
                "value": "Dark Gray #3"
            },
            {
                "key": "Sweater Style",
                "value": "Hooded Sweatshirts"
            }
        ],
        "additionalInfo": [
            " symoid Mens Sweatshirts & Hoodies 2022- Fall and Winter Unisex Hooded Sweater Printeding Pullover Blouse Dark Gray S  Dear customer, thank you very much for liking our Mens Sweatshirts & Hoodies ! ! !  We are a clothing store, search our brand name symoid, you can find more fashionable and high-quality spring, summer, autumn and winter men's clothing. Including but not limited to men's sweaters, sweatshirts & hoodies, men's coats, men's shirts, men's casual pants, men's jeans, etc.",
            " Premium Service: 30-DAY Buyer Protection.Returns & Money Back Guarantee! So you can buy our Sweatshirt & Hoodie 2022 with confidence! SizeChart:Size:S----Size:Small----US:4----UK:8----EU:34----Bust:39.37''----Length:27.95''----Shoulder:18.50''----Sleeve:24.02''Size:M----Size:Medium----US:6----UK:10----EU:36----Bust:41.73''----Length:28.74''----Shoulder:18.90''----Sleeve:24.41''Size:L----Size:Large----US:8----UK:12----EU:38----Bust:44.09''----Length:29.53''----Shoulder:19.29''----Sleeve:24.80''Size:XL----Size:X-Large----US:10----UK:14----EU:40----Bust:46.46''----Length:30.31''----Shoulder:20.08''----Sleeve:25.20''Size:XXL----Size:2X-Large----US:12----UK:16----EU:42----Bust:48.82''----Length:30.31''----Shoulder:20.87''----Sleeve:25.20''Size:XXXL----Size:3X-Large----US:14----UK:18----EU:44----Bust:51.18''----Length:31.10''----Shoulder:22.05''----Sleeve:25.59'' Additional Specifications:Top Colors: Dark GrayTop Size: S Season: spring, summer, autumn Gender:Men Occasion:Casual Material:Polyester Pattern Type:Printing Style:Casual Sleeve length:long Length:Regular Fit:Fits ture to size Thickness:Standard How to wash:Hand wash Cold,Hang or Line DryPackage: 2PC Men tops Note： Please compare the detail sizes with yours before you buy!!! Colors may be slightly different depending on computer and monitor settings Please allow 1-3cm differs due to manual measurement, thanks (All measurement in cm and please note 1cm=0.39inch) Keyword Search: Mens Big & Tall Sweatshirts & Hoodies,Mens Sweatshirts & Hoodies,Mens Athletic Sweatshirts,Mens Active Sweatshirts & Hoodies,Men's Character Shop,oversized sweatshirt for men,Activewear Top,Mens Hoodies,Mens Fleece,graphic sweatshirts,womens sweatshirt,Mens Big & Tall Active Jackets & Hoodies,Mens Activewear,men's fashion hoodies & sweatshirts,hallo-weentown sweatshirt,graphic hoodies,Mens Sweatshirts and Hoodies,sweatshirts for men,sweatshirt for men,hoodies for men,Mens Big & Tall Activewear,hallo-ween sweatshirt,Pullover Hoodies for Men,Mens Sweatshirts,crewneck sweatshirts,mens crewneck sweatshirt,comfort colors sweatshirts "
        ]
    },
    {
        "id": "1844642575",
        "url": "https://www.walmart.com/ip/1844642575?selected=true",
        "url_status": "200",
        "type": "Garment Steamers",
        "name": "Hemoton Iron Mini Steamer Travel Steam Iron Handheld Clothes Portable Garment Small Electric Micro Heat Press Ironingdry",
        "brand": "Hemoton",
        "manufacturerName": null,
        "shortDescription": [
            "&lt;strong&gt;&lt;strong&gt;&lt;b&gt;Note: This item comes with US plug, please confirm the voltage of your area before purchasing",
            "&lt;/b&gt;&lt;br /&gt;\n&lt;/strong&gt;&lt;br /&gt;\nDescription&lt;/strong&gt;&lt;br /&gt;\n&lt;br /&gt;\n&lt;span&gt;Made of durable material, it is durable and safe for long lasting use",
            "The handheld ironing machine is in a simple design, but it is very useful and practical",
            "The perfect performance of this household handheld iron will give you an excellent use experience",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;br /&gt;\n&lt;strong&gt;Features&lt;/strong&gt;&lt;br /&gt;\n&lt;br /&gt;\n-Material: ABS",
            "&lt;br /&gt;\n-Water tank capacity: 60ml",
            "&lt;br /&gt;\n-P&lt;span&gt;reheating time: 30s",
            "&lt;br /&gt;\n-&lt;span&gt;Rated voltage: 110V",
            "&lt;br /&gt;\n&lt;/span&gt;-&lt;span&gt;Power :30W&lt;br /&gt;\n&lt;span&gt;- The product is in a simple design, but it is very useful and practical",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- This household handheld iron is very easy to use, giving you much convenience",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- Our product is durable, high performance but price is more reasonable",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- Preferred materials, good material, they are safe, durable and practical",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- The excellent workmanship of our product will bring you a good using experience",
            "&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;"
        ],
        "specifications": [
            {
                "key": "Brand",
                "value": "Hemoton"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "C47O75196MIVCYLA5MMX136"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "7.87 x 5.31 x 1.97 Inches"
            }
        ],
        "additionalInfo": [
            "Note: This item comes with US plug, please confirm the voltage of your area before purchasing.  Description   Made of durable material, it is durable and safe for long lasting use. The handheld ironing machine is in a simple design, but it is very useful and practical. The perfect performance of this household handheld iron will give you an excellent use experience.   Features   -Material: ABS.  -Water tank capacity: 60ml.  -P reheating time: 30s. -Rated voltage: 110V. -Power :30W - The product is in a simple design, but it is very useful and practical. - This household handheld iron is very easy to use, giving you much convenience. - Our product is durable, high performance but price is more reasonable. - Preferred materials, good material, they are safe, durable and practical. - The excellent workmanship of our product will bring you a good using experience.",
            " The product is in a simple design, but it is very useful and practical. This household handheld iron is very easy to use, giving you much convenience. Our product is durable, high performance but price is more reasonable. Preferred materials, good material, they are safe, durable and practical. The excellent workmanship of our product will bring you a good using experience. "
        ]
    },
    {
        "id": "27966795",
        "url": "https://www.walmart.com/ip/27966795?selected=true",
        "url_status": "200",
        "type": "Filler Paper",
        "name": "Pacon Zaner-Bloser D'Nealian Multi-Program Tablet Handwriting Paper Grades K-1st 40 Sheets (2480)",
        "brand": "Pacon",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "1.00 x 1.00 x 1.00 Inches"
            }
        ],
        "additionalInfo": [
            "Multi-program tablet handwriting paper with rule size 5/8\" offer rulings that conform to both the Zaner-Bloser and D’Nealian handwriting programs.  Pacon Multi-Program Handwriting Papers offer rulings that conform to both the Zaner-Bloser and D'Nealian handwriting programs. Bright tablet paper ruled both sides with red baselines, blue dotted midlines and blue headlines. Recyclable.  • Age group and grade: Grades kindergarten - 1st. • Our multi-program handwriting papers offer rulings that conform to both the Zaner-Bloser and D'Nealian handwriting programs. • Bright tablet paper ruled both sides with red baselines, blue dotted midlines and blue headlines. • Picture story paper is ruled with a 4-1/4\" picture space on both sides. • Tablets have a heavy chipboard back and protective full page, four color, retail-friendly front cover. • Reams are film wrapped with a full page, four color, retail-friendly top sheet. • Ruling: Manuscript (handwriting). • Paper color: White. • Polywrapped: Yes. • Line spacing: 5/8\". • Recyclable. • Sheet size: 10-1/2\" x 8\".  • Sold as 12 pieces/Bundle.",
            " Sold as 12 pieces/Bundle. Age group and grade: Grades kindergarten - 1st. Tablets have a heavy chipboard back and protective full page, four color, retail-friendly front cover. Polywrapped: Yes. Our multi-program handwriting papers offer rulings that conform to both the Zaner-Bloser and D'Nealian handwriting programs. Reams are film wrapped with a full page, four color, retail-friendly top sheet. Line spacing: 5/8\". Bright tablet paper ruled both sides with red baselines, blue dotted midlines and blue headlines. Ruling: Manuscript (handwriting). Recyclable. Picture story paper is ruled with a 4-1/4\" picture space on both sides. Paper color: White. Sheet size: 10-1/2\" x 8\". "
        ]
    },
    {
        "id": "2692658417",
        "url": "https://www.walmart.com/ip/2692658417?selected=true",
        "url_status": "200",
        "type": "Wigs & Toupees",
        "name": "DOPI Real Remy Synthetic Human Hair Bob Hair Gray Wig Toupee Hairpiece Top Wig For Women",
        "brand": "Dopi",
        "manufacturerName": "DOPI",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Brand",
                "value": "Dopi"
            },
            {
                "key": "Wig Cap Type",
                "value": "Monofiliment"
            },
            {
                "key": "Age Group",
                "value": "Adult"
            },
            {
                "key": "Manufacturer",
                "value": "DOPI"
            },
            {
                "key": "Gender",
                "value": "Female"
            }
        ],
        "additionalInfo": [
            "1 PC Real Remy Human Hair Topper Toupee Hairpiece Lace Top Wig For Women  Features:   100% Brand New and high quality.  New women synthetic wigs women heat resistant wig full head  Hair Material High Temperature Wire fiber, made Cap, Seem as real human hair  Comfortable for daily wear; No damage to your own hair  Easy to wash and care.  The inner design is adjustable, so you are able to adjust the size for an ideal fit; The hooks inside the wig are fully adjustable to fit all sizes   Specification:  Style: Short Wig  Texture: Curly hair  Material: Synthetic wig Hair Color: as shown  Hair length：11 Inch  Weight: 150g  How to care: (1) Wash in cold or warm water ,Add a dash of Shampoo and wash gently (2) After shampooing squeeze out excess water and pat dry with a towel (3) Do not brush when wet allow wig to drip fry (4) Clean up with towel and let it dry naturally,  (5) Please do not use hair drier or put it expose to intense heat   Package Include:  1 x  wig    ",
            " Does not contain harmful chemicals materials-safe for you and your family to provide you with a more enjoyable experience appearance, color and texture similar to real hair, confused with real hair, fine workmanship, comfortable hand, easy to clean, small size, easy to carry, can be carried with you or worn everyday  High quality breathable mesh hat is soft and comfortable. The buckle net design can be used for a long time. It will allow you to redesign and easily change your look in seconds. It can give you more confidence and more charm! "
        ]
    },
    {
        "id": "2059580269",
        "url": "https://www.walmart.com/ip/2059580269?selected=true",
        "url_status": "200",
        "type": "Kitchen Utensil Organizers",
        "name": "Adjustable Cutlery Drawer Organizer, Flatware Drawer Tray for Silverware, Serving Utensils, Multi Purpose Organizer Tray for Kitchen, Office, Bathroom Small",
        "brand": "Esquirla",
        "manufacturerName": "Esquirla",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Brand",
                "value": "Esquirla"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "Does Not Apply"
            },
            {
                "key": "Assembled Product Weight",
                "value": "0.24 lb"
            },
            {
                "key": "Manufacturer",
                "value": "Esquirla"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "15.75 x 3.35 x 2.17 Inches"
            }
        ],
        "additionalInfo": [
            "Description: Kitchen Drawer Storage Organizer Tray: These drawer organizer can be used separately divide in different drawers, separatable and expandable to meet your all cutlery, right dimensions all your silverware neatly and comfortably.Premium quality: Kitchen cutlery drawer organizer made of high quality material, washable, smooth surface, thick and durable, not easy to deform.Compartments Divider: With 2 compartment plate, adjustable and sort place setting pieces, , forks, spoons, spatulas, whisks, utensils and other kitchen gadgets, all your silverware neatly, and save space.Multi Use: These organizer divider storage tray can storage baby products, clothes, tableware, toys, toiletry storage, underwear, makeup, snack, stationery and other sundries.Home Organization Solution: These cabinet drawer storage organizer tray perfectly fits large drawers, offer a generous capacity for your sundries and a nice way to customize your drawer layout. Specification: Material: Size Chart: Large Size:34.6x12x5cm/13.62x4.72x1.97inchSmall Size:34.6x8x5cm/13.62x3.15x1.97inch Package Includes: 1 Piece Kitchen Drawer Organizer Tray 2 Pieces Compartment Plate",
            " Compartments Cutlery divider tray Storage drawer storage tray adjustable makeup brush Tableware Silverware Storage Drawer storage box "
        ]
    },
    {
        "id": "47758033",
        "url": "https://www.walmart.com/ip/47758033?selected=true",
        "url_status": "200",
        "type": "Electric Blankets",
        "name": "Biddeford 1001-903292-535 Comfort Knit Fleece Electric Heated Blanket Full Blue",
        "brand": "Biddeford",
        "manufacturerName": "Biddeford",
        "shortDescription": [
            "Energy Saving - Save money on your home heating bills by turning down your thermostat while you use this heated blanketAnalog control provides therapeutic warmth with 10 heat settings and auto shut off featureMachine wash and dry for your convenience, Packaged in a reusable zipper bag with handle100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "Analog control provides therapeutic warmth with 10 heat settings and auto shut off featureMachine wash and dry for your convenience, Packaged in a reusable zipper bag with handle100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "Machine wash and dry for your convenience, Packaged in a reusable zipper bag with handle100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "Five Year Manufacturer Warranty"
        ],
        "specifications": [
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Assembled Product Weight",
                "value": "6 lb"
            },
            {
                "key": "Bed Size",
                "value": "Full"
            },
            {
                "key": "Fabric Content",
                "value": "100.00% Polyester"
            },
            {
                "key": "Brand",
                "value": "Biddeford"
            },
            {
                "key": "Material",
                "value": "Fleece"
            },
            {
                "key": "Size",
                "value": "Full"
            },
            {
                "key": "Model",
                "value": "1001-903292-535"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "1001-903292-535"
            },
            {
                "key": "Manufacturer",
                "value": "Biddeford"
            },
            {
                "key": "Color",
                "value": "Cloud Blue"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "1.00 x 84.00 x 90.00 Inches"
            }
        ],
        "additionalInfo": [
            "The Biddeford Comfort Knit Fleece Heated Blanket is just the thing to get the chill out when the weather gets nasty. In Full size, cloud blue this magnificently soft polyester blanket is just great for getting warm. Analog controller features 10 personal heat settings, allowing you to get just the right temperature. It also features an automatic shut-off feature, which turns the blanket off after 10 hours. The twin and full size blankets include one controller. The queen and king size blankets include two controllers.  Twin Size (single controller) 62\" X 84\" Full Size (single controller) 72\" X 84\" Queen Size (Dual controllers) 84\" X 90\" King Size (Dual controllers) 100\" X 90\" *Note for Customers Outside of North America. These heated bedding products were made to work with 110V Electrical systems. If you live in a country that utilizes a different electrical system you may need to use a converter for these products to function. The act of using a converter automatically voids the warranty on these products. **All Biddeford Blankets are rigorously tested and approved by a third party (UL or ETK Intertek) to comply with current industry safety standards. Please reference the included use and safety instructions to insure safe operation. Additional safety certification for this product can be viewed on the UL or Intertek websites or by calling their perspective customer care phone numbers. Features:  Energy Saving - Save money on your home heating bills by turning down your thermostat while you use this heated blanket Analog control provides therapeutic warmth with 10 heat settings and auto shut off feature Machine wash and dry for your convenience, Packaged in a reusable zipper bag with handle 100% Polyester comfort knit fleece, Ultra-thin wire for added comfort Five Year Manufacturer Warranty ",
            " Energy Saving - Save money on your home heating bills by turning down your thermostat while you use this heated blanket Analog control provides therapeutic warmth with 10 heat settings and auto shut off feature Machine wash and dry for your convenience, Packaged in a reusable zipper bag with handle 100% Polyester comfort knit fleece, Ultra-thin wire for added comfort Five Year Manufacturer Warranty "
        ]
    },
    {
        "id": "1426349020",
        "url": "https://www.walmart.com/ip/1426349020?selected=true",
        "url_status": "200",
        "type": "Electric Skillets",
        "name": "Electric Nonstick Cooker Skillet Wok Hot Pot Cook Rice Fried Noodle（2.8L,With Steamer）",
        "brand": "Jian Ya Na",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "Non-Stick"
            },
            {
                "key": "Brand",
                "value": "Jian Ya Na"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "HTG-047"
            }
        ],
        "additionalInfo": [
            "Why choose Mingfuxin Non-Stick Electric Skillet?Hot pot has two gears, so it is very simple and convenient.At first, you can turn it to the \"high\" position, making it heat rapidly. After food had been cooked completely,you can switch to \"LOW\" position and it will heat persistently.Professional electric chafing dish, make the operation simple, make your life simple.Size:20CM Diameter: suitable for 1-2 people, Power: 300W-600W, Capacity: 2.3L22CM Diameter: suitable for 2 people, Power: 300W-600W, Capacity: 2.8L24CM Diameter: suitable for 2-3 people, Power: 400W-800W, Capacity: 3.2L26CM Diameter: suitable for 3-4 people, Power: 500W-1000W, Capacity: 3.6LSpecification:Voltage: 110VFrequency: 60HzModel: SW - 20Capacity: 2L-3LWeight: 1.5-2kg Package Included:1 x Electric Skillet(Steamer can be added)1 x Power Cord1 x Pair of Chopsticks1 x Wooden Shovel1 x Big Spoon1 x Dishcloth1 x Manual",
            "      1.【Healthy cooking】 coating does not contain harmful chemicals and is PTFE and PFOA free. Deluxe ceramic nonstick coating, for stick-free cooking and easy cleaning. Multi-function electric skillet can be used for cooking, frying, boiling, braising, stewing, steaming.         2.【Premium Material and Durable】High-quality aluminum body and superior round heating element provide faster and even heat distribution when cooking. Durable heat-tempered glass cover that handles high temperatures and steam without breaking.         3.【Safe Protection】With Big Anti-scalding Handle,it's easy and comfortable to grip and touch the Frying Pans,effective heat insulation and anti-scalding. When the water dry or ultra high temperature (higher than 175 ° C) automatic power off to protect your safety.         4.【Convenient to Use】The Electric skillet has fast and slow two heating modes, easy to operate. At the same time, you can use the steaming and boiling method to save you time.         5.【Easy to Care】Pot body can be washed after power off, convenient and safe. Before cleaning, please unplug the power plug and let the pot cool. Do not use the steel ball when washing, please use a soft cleaning cloth, otherwise it will scratch the non- stick layer.    "
        ]
    },
    {
        "id": "1539849254",
        "url": "https://www.walmart.com/ip/1539849254?selected=true",
        "url_status": "200",
        "type": "Mattresses",
        "name": "2 in 1 Full Mattress, 6 inch Memory Foam Mattress, Bed Mattress with Cover, Pressure Relieving Mattress Topper, White",
        "brand": "Yangming",
        "manufacturerName": "Yangming",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Brand",
                "value": "Yangming"
            },
            {
                "key": "Bed Size",
                "value": "Full"
            },
            {
                "key": "Mattress Type",
                "value": "Memory Foam Mattresses"
            },
            {
                "key": "Mattress Comfort Level",
                "value": "Medium Firm"
            },
            {
                "key": "Mattress Thickness",
                "value": "6"
            },
            {
                "key": "Material",
                "value": "Memory Foam"
            },
            {
                "key": "Color",
                "value": "White"
            },
            {
                "key": "Assembled Product Weight",
                "value": "52 lb"
            },
            {
                "key": "Manufacturer",
                "value": "Yangming"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "2 inch 1-White-6"
            },
            {
                "key": "Model",
                "value": "2 inch 1-White-6"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "75.00 x 54.00 x 6.00 Inches"
            }
        ],
        "additionalInfo": [
            "Are you still searching for the perfect mattress? This will be the best mattress you will encounter! We researched the needs of most people, and finally developed this 2 in 1 mattress. When separated, they are two toppers; when combined, they become a new mattress.You can match the color and thickness of the mattress topper to create your own mattress. Gel memory foam adjusts to your body temperature so you can have cool sleep and reduces pressure point. This ergonomic design perfectly conforms to your body shape and is suitable for all sleeper types. This mattress resists sagging, rolling-off, and all this with a medium-firm feel. Being a CertiPUR-US certified foam guarantees you a safe and healthy sleep. The mattresses come compressed in a box and will be smartly shipped to your door for easy setup.   Features:  The gel memory foam mattress slowly adjusts to body weight and temperature to provide you with cool sleep  Ergonomic design conforms to your body from the stomach to your side and finally to the back to keep the body and spine aligned  Great for all sleep types and all sleepers such as the back, stomach, and side sleepers  CertiPUR-US certified foam for healthy and safe sleep. No formaldehyde, low VOCs, and no ozone depletes  Mattress in a box that comes compressed and rolled for shipping and easy setup, your kids can even help  Wait 72 hours for your mattress to fully expand to its original shape   Specifications:  Twin hybrid mattress: 75\" L x 39\" W x 6‘’ or 8\" H  Full hybrid mattress: 75\" L x 54\" W x 6‘’ or 8\" H  Queen hybrid mattress: 80\" L x 60\" W x 6‘’ or 8\" H  King hybrid mattress: 80\" L x 76\" W x 6‘’ or 8\" H ",
            "  Original 2-in-1 Mattress Design: This will be the best mattress you will encounter! We researched the needs of most people, and finally developed this 2 in 1 mattress. When separated, they are two toppers; when combined, they become a new mattress.You can match the color and thickness of the mattress topper to create your own mattress.   No Glass Fiber Flame: Our mattress is made of safe and efficient flame retardant material without glass fiber. There will be no skin irritation, breathing and air pollution issues, so you and your family can rest comfortable on mattress and you can really rest easy at night.   Medium Firmness: Our mattresses have been tested many times, and finally we have created this mattress with moderate firmness. Our mattresses provide you with enough support to sleep without sinking and avoid back problems. Meanwhile, our mattress is made of memory foam, which relieves the pressure on your body.   Easy to clean: Our Mattress topper is designed with zipper, which is convenient for you to disassemble and clean. You can just remove the cover and wash it. The foam can bask in the sun, without the need to wash with water.   Instant Enjoyment: Compressed into a box, it is easy to transport and operate into the bedroom. Just unpack, unfold, and enjoy this mattress.  "
        ]
    },
    {
        "id": "149984760",
        "url": "https://www.walmart.com/ip/149984760?selected=true",
        "url_status": "200",
        "type": "Incontinence Protective Underwear",
        "name": "Prevail Daily Disposable Underwear Small Youth, PV-511, Extra, 88 Ct",
        "brand": "Prevail",
        "manufacturerName": "first quality",
        "shortDescription": [
            "Stay protected from incontinence issues with this Small Adult 88-Count package of Prevail Extra Absorbency Underwear",
            "They have a soft cloth-like Skin Smart inner and outer fabric made with aloe, vitamin E and chamomile for skin wellness",
            "The small adult and youth disposable underwear feature elastic gathers around the leg openings and Advanced Discreet Core technology that locks away moisture quickly to prevent leaks and odors",
            "They also pull up and down just like real underwear for ease of use",
            "The Small Adult 88-Count Prevail Extra Absorbency Underwear are suitable for men and women and children",
            "They come in a four-pack with each bag containing 22 briefs each"
        ],
        "specifications": [
            {
                "key": "Gender",
                "value": "Unisex"
            },
            {
                "key": "Size",
                "value": "S"
            },
            {
                "key": "Scent",
                "value": "Unscented"
            },
            {
                "key": "Brand",
                "value": "Prevail"
            },
            {
                "key": "Absorbency",
                "value": "Moderate"
            },
            {
                "key": "manufacturer_part_number",
                "value": "pv-511"
            },
            {
                "key": "Color",
                "value": "Multicolor"
            },
            {
                "key": "Manufacturer",
                "value": "first quality"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "12.15 x 15.60 x 11.55 Inches"
            }
        ],
        "additionalInfo": [
            "Stay protected from incontinence issues with this Small Adult 88-Count package of Prevail Extra Absorbency Underwear. They have a soft cloth-like Skin Smart inner and outer fabric made with aloe, vitamin E and chamomile for skin wellness. The small adult and youth disposable underwear feature elastic gathers around the leg openings and Advanced Discreet Core technology that locks away moisture quickly to prevent leaks and odors. They also pull up and down just like real underwear for ease of use. The Small Adult 88-Count Prevail Extra Absorbency Underwear are suitable for men and women and children. They come in a four-pack with each bag containing 22 briefs each.",
            " Prevail Extra Pull-On Underwear, Youth/Small Adult, 88 Count:   Prevail extra protective underwear goes beyond protecting from leakage associated with moderate leakage associated with urge and mixed incontinence It has improved efficiency by reducing odors and promoting skin health Advanced Discreet core technology has exceptional performance with added comfort and discretion Extra absorbency provides leakage protection and comfort Skin Smart fabric is made with aloe, vitamin E and chamomile for skin wellness Pulls up and down like real underwear Advanced Zoning System Manufacturer # PV-511 Brand: Prevail Extra Manufacturer: First Quality Absorbent capacity: moderate absorbency Application: absorbent underwear Backing material: cloth-like Color: white Gender: unisex HCPCS A4520 T4525 (Disclaimer) Leg style: elastic gathers Size: small Sizing range: 20\" - 34\" waist/hip Style: pull-on Top sheet material: cloth-like UNSPSC code: 53102303 Usage: disposable User: youth Latex-free indicator not made with natural rubber latex 22 per pack, 4 packs per case Labels may vary "
        ]
    },
    {
        "id": "1765107876",
        "url": "https://www.walmart.com/ip/1765107876?selected=true",
        "url_status": "200",
        "type": "Chicken Coops",
        "name": "Outdoor Wooden Chicken Coop for 2-3 Chickens Hen House 67\" Poultry Cage w/ Ramp and Nesting Box",
        "brand": "ECOLINEAR",
        "manufacturerName": "ECOLINEAR",
        "shortDescription": [
            "This chicken coop is for those who simply want to upgrade their backyard garden, keeping chickens has became the new craze with the Chicken coops you can give them a home of their own that is both stylish and functional",
            "A large inside area and extra run cage give the animals more space to move around",
            "Besides, the nesting box can hold two chickens at the same time, it is perfect for chicken to lay eggs in"
        ],
        "specifications": [
            {
                "key": "Features",
                "value": "Waterproof"
            },
            {
                "key": "Brand",
                "value": "ECOLINEAR"
            },
            {
                "key": "Manufacturer",
                "value": "ECOLINEAR"
            },
            {
                "key": "Animal Type",
                "value": "Chicken"
            },
            {
                "key": "Color",
                "value": "Brown"
            },
            {
                "key": "Assembled Product Weight",
                "value": "67 lb"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "67.50 x 24.00 x 40.50 Inches"
            }
        ],
        "additionalInfo": [
            "This chicken coop is for those who simply want to upgrade their backyard garden, keeping chickens has became the new craze with the Chicken coops you can give them a home of their own that is both stylish and functional. A large inside area and extra run cage give the animals more space to move around. Besides, the nesting box can hold two chickens at the same time, it is perfect for chicken to lay eggs in.",
            "ã\u0080\u0090Waterproof Roofã\u0080\u0091for extra resistance and protection from outdoor elements, chicken coop will keep the animals dry and safe in most rainy days. ã\u0080\u0090Removable Trayã\u0080\u0091rabbit hutch comes with a removable bottom sliding tray for easy cleaning. ã\u0080\u0090Egg Collection Boxã\u0080\u0091The chicken coop is equipped with an egg box, easy way to deposit and collect eggs. ã\u0080\u0090Wire Fencingã\u0080\u0091is vital to the ventilation of chicken coops, it will also protect your animals from outside predators. ã\u0080\u0090Easy Access Rampã\u0080\u0091Ladder of the chicken run gives easy access to enter the raised housing area, with timber ridges above the ramp to protects your poultry from slipping back. "
        ]
    },
    {
        "id": "1236350889",
        "url": "https://www.walmart.com/ip/1236350889?selected=true",
        "url_status": "200",
        "type": "Sweatpants",
        "name": "Inleife Mens Plus Size Sweatphants Pants Clearance Men's Pants Sweatpants Pant Hip-hop Pants Legging Padded Casual Plus Size Pants",
        "brand": "Inleife",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "Full Long Pants for Men clearance"
            },
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "2XL"
            },
            {
                "key": "Fabric Content",
                "value": "95% Polyester"
            },
            {
                "key": "Brand",
                "value": "Inleife"
            },
            {
                "key": "Gender",
                "value": "Male"
            },
            {
                "key": "Color",
                "value": "Dark Gray"
            }
        ],
        "additionalInfo": [
            "Men's Pants Pants Sweatpants Hip-hop Pants Legging Padded Casual Pants   Item specifics   1. You will feel comfortable all day. Moreover, this Pants is non-irritating.   2. This Pants features drawstring banded waistband. It also guarantees a   as it is made of high-quality and eco-friendly bamboo fiber.   3. High elasticity, no movement.   4. Your best sports companion.   5. Pocket design for easy mobile phone   Gender:Men  Season:Spring, Autumn, Winter Occasion:Sport or daliy Material:Polyester Pant Style:Pants, Tights, Leggings  Pattern Type:Adjustable Waist, Ankle Length, Breathable, Drawstring,  Elastic Waist, Insulated, Stretch, Wind Resistant, Wrinkle Resistant  Package include:1PC Sweatpants   Size: S Waist: 74cm/29.13'' Length: 100cm/39.37'' Hip: 108cm/42.52''  Size: M Waist: 80cm/31.50'' Length: 102cm/40.16'' Hip: 114cm/44.88''  Size: L Waist: 86cm/33.86'' Length: 104cm/40.94'' Hip: 120cm/47.24''  Size: XL Waist: 92cm/36.22'' Length: 106cm/41.73'' Hip: 126cm/49.61''  Size: XXL Waist: 98cm/38.58'' Length: 108cm/42.52'' Hip: 132cm/51.97''  Size: XXXL Waist: 104cm/40.94'' Length: 110cm/43.31'' Hip: 138cm/54.33''",
            " Inleife Mens Plus Size Sweatphants Pants Clearance Men's Pants Sweatpants Pant Hip-hop Pants Legging Padded Casual Plus Size Pants Men's autumn and winter Long pants Comfortable and breathable materials always protect your skin In many sizes and colors, there is always one for you Suitable for home, travel and party "
        ]
    },
    {
        "id": "1219886074",
        "url": "https://www.walmart.com/ip/1219886074?selected=true",
        "url_status": "200",
        "type": "Automotive Organizers",
        "name": "ZFITEI 2 Pack Backseat Car Organizer, 10 Storage Pockets Car Organizers and Storage with Touch Screen Tablet Holder, Heavy Duty Waterproof and Stain Resistant Kick Mats Back Seat Protector for Kids",
        "brand": "ZFITEI",
        "manufacturerName": null,
        "shortDescription": [
            "2 Pack Backseat Car Organizer, 10 Storage Pockets Car Organizers and Storage with Touch Screen Tablet Holder, Heavy Duty Waterproof and Stain Resistant Kick Mats Back Seat Protector for Kids"
        ],
        "specifications": [
            {
                "key": "Brand",
                "value": "ZFITEI"
            },
            {
                "key": "Color",
                "value": "Black"
            }
        ],
        "additionalInfo": [
            "2 Pack Backseat Car Organizer, 10 Storage Pockets Car Organizers and Storage with Touch Screen Tablet Holder, Heavy Duty Waterproof and Stain Resistant Kick Mats Back Seat Protector for Kids",
            " ORGANIZE YOUR STUFF - 24x16 inches in size, extra long straps with quick-release buckles ensure a perfect fit for any car; Car organizers, not only will your belongings be at your fingertips while traveling, but you can forget about the mess on the backs of the front seats - they'll be neat and clean from now on. PLENTY OF STORAGE COMPARTMENTS - Made of improved strong 600D polyester, waterproof frosted PVC, durable, safe and reliable; The rear seat car organizer has 10 different sized compartments, including a clear tablet holder, water bottle pockets, and a large mesh pocket for other essentials. TRANSPARENT TABLET STAND - Our rear seat car organizer bag comes with a clear tablet stand that will keep your kids entertained and make it easy for them to touch the screen. VERY DURABLE - Waterproof, machine washable fabric, easy for you to clean muddy footprints, suitable for traveling, children. EASY TO INSTALL - Car footrests with adjustable straps are suitable for all types of vehicles and can be simply installed to store different items in the car while keeping the space organized. "
        ]
    },
    {
        "id": "2189334404",
        "url": "https://www.walmart.com/ip/2189334404?selected=true",
        "url_status": "200",
        "type": "Athletic Outfit Sets",
        "name": "Aislor Girls Cheer Leader Uniform Cheerleading Halloween Cosplay Outfits",
        "brand": "Aislor",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Clothing Size Group",
                "value": "Girls"
            },
            {
                "key": "Clothing Size",
                "value": "12"
            },
            {
                "key": "Color",
                "value": "Light Pink"
            },
            {
                "key": "Age Group",
                "value": "Child"
            },
            {
                "key": "Gender",
                "value": "Female"
            },
            {
                "key": "Brand",
                "value": "Aislor"
            }
        ],
        "additionalInfo": [
            "Set Include: 1Pc Crop Top, 1Pc SkirtCondition: New with tagMaterial: 70% Polyester, 20% Spandex, 10% Nylon    Tag No. Recommended Size Chest Tops Length Skirt Length Skirt Waist   6 6 21.5\"/55.5cm 9\"/23cm 11.5\"/29.5cm 19.5\"/50cm   8 8 23.5\"/60.5cm 9.5\"/24.5cm 12.5\"/32cm 21.5\"/55cm   10 10 25.5\"/65.5cm 10.5\"/26.5cm 13\"/34cm 23.5\"/60cm   12 12 27.5\"/70.5cm 11\"/28.5cm 14\"/36cm 25.5\"/65cm   14 14 29.5\"/75.5cm 12\"/30.5cm 15\"/38cm 27.5\"/70cm   16 16 31.5\"/80.5cm 12.5\"/32.5cm 15.5\"/40cm 29.5\"/75cm   ",
            " Made of high quality material, light weight, soft, breathable and comfortable for baby wearing. The crop top features with sleeveless and v neckline, letter “CHEER” print in the front. Matching with good elasticity waistband skirt, patchwork style design, no lining. Size Table means age ranges for girls, but they are for general guidance only, hand wash cold. Suitable for any occasion, dance, daily life, cheerleading, stage performance, competition and so on. "
        ]
    },
    {
        "id": "1664692920",
        "url": "https://www.walmart.com/ip/1664692920?selected=true",
        "url_status": "200",
        "type": "Bras",
        "name": "Push Up Plunge Strapless Sticky Adhesive Bra Deep U-Shaped Invisible Backless Bra for Women",
        "brand": "Heldig",
        "manufacturerName": "Heldig",
        "shortDescription": [
            "Push Up Plunge Strapless Sticky Adhesive Bra Deep U-Shaped Invisible Backless Bra for Women",
            "Natural silicone: skin-friendly adhesive, suitable for sensitive skin.",
            "Will make a sexy and natural deep v-shape breast for you.",
            "Reusable: sticky after washing, reusable.",
            "Invisiable bra: perfect for low-cut outfits or backless strapless dresses.",
            "The plunge bra creates the effect of deep “v”, thereby helps gather your chest and achieve full coverage to make a deep attractive.cleavage.",
            "This push up lift bra creates the appearance of increased cleavage.Get extra cleavage without the bra straps and say goodbye to all embarrassing occasions!",
            "Reusable bra, but too much sweat will affect stickiness, so the Silicone Push-up Adhesive Bra is not suitable for using in high temperature outdoors or doing exercise.Simply hand wash with running water after each use and air dry it.",
            "The U-design sticky bra is not recommended for using in high temperature outdoors or working due to too much sweat will affect the effectiveness of the adhesive, so you need wear clean before chest to make sure you don't use any body oil or lotion before sticking this to your skin or it won't stick at all.",
            "Use water or laundry detergent to gently glue the surface, and let it dry naturally and do not expose it to the sun. Then seal and store in a cool and dry place to prevent sticking dust.",
            "Clean your chest with mild soap and water.",
            "Remove the protective film from the bra.",
            "Stand in front of the mirror , press and hold contour cups to skin",
            "for several moments to to adhere cups to skin, to place breasts comfortably into contour cups",
            "Connect the two bra cups together with the front closure."
        ],
        "specifications": [
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "a"
            },
            {
                "key": "Brand",
                "value": "Heldig"
            },
            {
                "key": "Model",
                "value": "WMZY-769-1"
            },
            {
                "key": "Manufacturer",
                "value": "Heldig"
            }
        ],
        "additionalInfo": [
            "Product Description    Push Up Plunge Strapless Sticky Adhesive Bra Deep U-Shaped Invisible Backless Bra for Women    FEATURES    Natural silicone: skin-friendly adhesive, suitable for sensitive skin.   Will make a sexy and natural deep v-shape breast for you.   Reusable: sticky after washing, reusable.   Invisiable bra: perfect for low-cut outfits or backless strapless dresses.    Plunge Bra    The plunge bra creates the effect of deep “v”, thereby helps gather your chest and achieve full coverage to make a deep attractive.cleavage.    Push Up Bra    This push up lift bra creates the appearance of increased cleavage.Get extra cleavage without the bra straps and say goodbye to all embarrassing occasions!    Invisible Strapless Bra    Reusable bra, but too much sweat will affect stickiness, so the Silicone Push-up Adhesive Bra is not suitable for using in high temperature outdoors or doing exercise.Simply hand wash with running water after each use and air dry it.    WEARING NOTES&WASH TIPS    The U-design sticky bra is not recommended for using in high temperature outdoors or working due to too much sweat will affect the effectiveness of the adhesive, so you need wear clean before chest to make sure you don't use any body oil or lotion before sticking this to your skin or it won't stick at all.   Use water or laundry detergent to gently glue the surface, and let it dry naturally and do not expose it to the sun. Then seal and store in a cool and dry place to prevent sticking dust.    TIPS    Clean your chest with mild soap and water.   Remove the protective film from the bra.   Stand in front of the mirror , press and hold contour cups to skin   for several moments to to adhere cups to skin, to place breasts comfortably into contour cups   Connect the two bra cups together with the front closure.   ",
            " HIGH-QUALITY BREATHABLE FABRIC: Softness: Our adhesive bra are made up of high quality spandex and Lycra fabric, skin-friendly and comfortable.High-quality fabrics have good breath ability and are more refreshing.No static electricity, friction, no ball. DEEP U PLUNGE BRA DESIGN:Our U-shaped bra creates a busty,fuller and charming deep v shape breast; V shape design, fits for your breasts.The sticking is firm, the thickened side sticks help the sides to gather together. SUIITABLE FOR ALL OCCASIONS:The u-shaped design adhesive bra is prefect for daily wear and unique occasion dressing such us evening dress, wedding, slip dress, low cut dress, active wear, Christmas, leisure, cocktail, night scene and party, etc. WEARING NOTES:The U-design sticky bra is not recommended for using in high temperature outdoors or working due to too much sweat will affect the effectiveness of the adhesive, so you need wear clean before chest to make sure you don't use any body oil or lotion before sticking this to your skin or it won't stick at all. WASH TIPS:Use water or laundry detergent to gently glue the surface, and let it dry naturally and do not expose it to the sun. Then seal and store in a cool and dry place to prevent sticking dust. "
        ]
    },
    {
        "id": "1970062201",
        "url": "https://www.walmart.com/ip/1970062201?selected=true",
        "url_status": "200",
        "type": "Dresses",
        "name": "Pntutb Womens Plus Size Clearance,Summer Dresses For Women's Beach Floral Print Sleeveless Tank Swing Dress Black S",
        "brand": "PNTUTB",
        "manufacturerName": "Pntutb",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "Womens plus size clearance $5, Womens deals, Summer savings"
            },
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "S"
            },
            {
                "key": "Fabric Content",
                "value": "100% Polyester Spandex"
            },
            {
                "key": "Brand",
                "value": "PNTUTB"
            },
            {
                "key": "Gender",
                "value": "Female"
            },
            {
                "key": "Model",
                "value": "SLZX220822A0099"
            },
            {
                "key": "Color",
                "value": "Black"
            },
            {
                "key": "Manufacturer",
                "value": "Pntutb"
            }
        ],
        "additionalInfo": [
            "Pntutb Womens Plus Size Clearance,Summer Dresses For Women's Beach Floral Print Sleeveless Tank Swing Dress Black S Gender: Women/Female/Girl   Season: Four seasons   Occasion: Daily   Style: Sexy, Fashion, Leisure   It is made of high quality materials, durable enought for your daily wearing.   I am sure you will like it!   This stylish casual women's clothing fits your body perfectly and makes you feel relaxed and comfortable.   If you have any questions about this products, please feel free to contact us. We will contact you within 24 hours to provide you with a better solution.   Garment care: Machine or hand wash with cold water, hang or line dry, no bleach. We love our customers and take pride in providing a pleasant shopping experience.   KEY1: Rollback and clearance clothes under 5$, Womens plus size clearance $5, Dresses for women 2022, Womens clearance under $10, Summer womens tops   KEY2: Womens shorts ,Womens pants, Lingerie for women, Bras for women, Gift",
            " Womens deals Womens plus size clearance $5 Dresses for women 2022 Womens clearance under $10 Summer womens tops "
        ]
    },
    {
        "id": "1307051717",
        "url": "https://www.walmart.com/ip/1307051717?selected=true",
        "url_status": "200",
        "type": "Sweatshirts & Hoodies",
        "name": "symoid Mens Sweatshirts & Hoodies 2022- Fall and Winter Unisex Hooded Sweater Printeding Pullover Blouse Dark Gray S",
        "brand": "Symoid",
        "manufacturerName": "symoid",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "discount"
            },
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Clothing Size",
                "value": "S"
            },
            {
                "key": "Brand",
                "value": "Symoid"
            },
            {
                "key": "Gender",
                "value": "Male"
            },
            {
                "key": "Manufacturer",
                "value": "symoid"
            },
            {
                "key": "Color",
                "value": "Dark Gray #3"
            },
            {
                "key": "Sweater Style",
                "value": "Hooded Sweatshirts"
            }
        ],
        "additionalInfo": [
            " symoid Mens Sweatshirts & Hoodies 2022- Fall and Winter Unisex Hooded Sweater Printeding Pullover Blouse Dark Gray S  Dear customer, thank you very much for liking our Mens Sweatshirts & Hoodies ! ! !  We are a clothing store, search our brand name symoid, you can find more fashionable and high-quality spring, summer, autumn and winter men's clothing. Including but not limited to men's sweaters, sweatshirts & hoodies, men's coats, men's shirts, men's casual pants, men's jeans, etc.",
            " Premium Service: 30-DAY Buyer Protection.Returns & Money Back Guarantee! So you can buy our Sweatshirt & Hoodie 2022 with confidence! SizeChart:Size:S----Size:Small----US:4----UK:8----EU:34----Bust:39.37''----Length:27.95''----Shoulder:18.50''----Sleeve:24.02''Size:M----Size:Medium----US:6----UK:10----EU:36----Bust:41.73''----Length:28.74''----Shoulder:18.90''----Sleeve:24.41''Size:L----Size:Large----US:8----UK:12----EU:38----Bust:44.09''----Length:29.53''----Shoulder:19.29''----Sleeve:24.80''Size:XL----Size:X-Large----US:10----UK:14----EU:40----Bust:46.46''----Length:30.31''----Shoulder:20.08''----Sleeve:25.20''Size:XXL----Size:2X-Large----US:12----UK:16----EU:42----Bust:48.82''----Length:30.31''----Shoulder:20.87''----Sleeve:25.20''Size:XXXL----Size:3X-Large----US:14----UK:18----EU:44----Bust:51.18''----Length:31.10''----Shoulder:22.05''----Sleeve:25.59'' Additional Specifications:Top Colors: Dark GrayTop Size: S Season: spring, summer, autumn Gender:Men Occasion:Casual Material:Polyester Pattern Type:Printing Style:Casual Sleeve length:long Length:Regular Fit:Fits ture to size Thickness:Standard How to wash:Hand wash Cold,Hang or Line DryPackage: 2PC Men tops Note： Please compare the detail sizes with yours before you buy!!! Colors may be slightly different depending on computer and monitor settings Please allow 1-3cm differs due to manual measurement, thanks (All measurement in cm and please note 1cm=0.39inch) Keyword Search: Mens Big & Tall Sweatshirts & Hoodies,Mens Sweatshirts & Hoodies,Mens Athletic Sweatshirts,Mens Active Sweatshirts & Hoodies,Men's Character Shop,oversized sweatshirt for men,Activewear Top,Mens Hoodies,Mens Fleece,graphic sweatshirts,womens sweatshirt,Mens Big & Tall Active Jackets & Hoodies,Mens Activewear,men's fashion hoodies & sweatshirts,hallo-weentown sweatshirt,graphic hoodies,Mens Sweatshirts and Hoodies,sweatshirts for men,sweatshirt for men,hoodies for men,Mens Big & Tall Activewear,hallo-ween sweatshirt,Pullover Hoodies for Men,Mens Sweatshirts,crewneck sweatshirts,mens crewneck sweatshirt,comfort colors sweatshirts "
        ]
    },
    {
        "id": "1844642575",
        "url": "https://www.walmart.com/ip/1844642575?selected=true",
        "url_status": "200",
        "type": "Garment Steamers",
        "name": "Hemoton Iron Mini Steamer Travel Steam Iron Handheld Clothes Portable Garment Small Electric Micro Heat Press Ironingdry",
        "brand": "Hemoton",
        "manufacturerName": null,
        "shortDescription": [
            "&lt;strong&gt;&lt;strong&gt;&lt;b&gt;Note: This item comes with US plug, please confirm the voltage of your area before purchasing",
            "&lt;/b&gt;&lt;br /&gt;\n&lt;/strong&gt;&lt;br /&gt;\nDescription&lt;/strong&gt;&lt;br /&gt;\n&lt;br /&gt;\n&lt;span&gt;Made of durable material, it is durable and safe for long lasting use",
            "The handheld ironing machine is in a simple design, but it is very useful and practical",
            "The perfect performance of this household handheld iron will give you an excellent use experience",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;br /&gt;\n&lt;strong&gt;Features&lt;/strong&gt;&lt;br /&gt;\n&lt;br /&gt;\n-Material: ABS",
            "&lt;br /&gt;\n-Water tank capacity: 60ml",
            "&lt;br /&gt;\n-P&lt;span&gt;reheating time: 30s",
            "&lt;br /&gt;\n-&lt;span&gt;Rated voltage: 110V",
            "&lt;br /&gt;\n&lt;/span&gt;-&lt;span&gt;Power :30W&lt;br /&gt;\n&lt;span&gt;- The product is in a simple design, but it is very useful and practical",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- This household handheld iron is very easy to use, giving you much convenience",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- Our product is durable, high performance but price is more reasonable",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- Preferred materials, good material, they are safe, durable and practical",
            "&lt;/span&gt;&lt;br /&gt;\n&lt;span&gt;- The excellent workmanship of our product will bring you a good using experience",
            "&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;"
        ],
        "specifications": [
            {
                "key": "Brand",
                "value": "Hemoton"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "C47O75196MIVCYLA5MMX136"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "7.87 x 5.31 x 1.97 Inches"
            }
        ],
        "additionalInfo": [
            "Note: This item comes with US plug, please confirm the voltage of your area before purchasing.  Description   Made of durable material, it is durable and safe for long lasting use. The handheld ironing machine is in a simple design, but it is very useful and practical. The perfect performance of this household handheld iron will give you an excellent use experience.   Features   -Material: ABS.  -Water tank capacity: 60ml.  -P reheating time: 30s. -Rated voltage: 110V. -Power :30W - The product is in a simple design, but it is very useful and practical. - This household handheld iron is very easy to use, giving you much convenience. - Our product is durable, high performance but price is more reasonable. - Preferred materials, good material, they are safe, durable and practical. - The excellent workmanship of our product will bring you a good using experience.",
            " The product is in a simple design, but it is very useful and practical. This household handheld iron is very easy to use, giving you much convenience. Our product is durable, high performance but price is more reasonable. Preferred materials, good material, they are safe, durable and practical. The excellent workmanship of our product will bring you a good using experience. "
        ]
    },
    {
        "id": "27966795",
        "url": "https://www.walmart.com/ip/27966795?selected=true",
        "url_status": "200",
        "type": "Filler Paper",
        "name": "Pacon Zaner-Bloser D'Nealian Multi-Program Tablet Handwriting Paper Grades K-1st 40 Sheets (2480)",
        "brand": "Pacon",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "1.00 x 1.00 x 1.00 Inches"
            }
        ],
        "additionalInfo": [
            "Multi-program tablet handwriting paper with rule size 5/8\" offer rulings that conform to both the Zaner-Bloser and D’Nealian handwriting programs.  Pacon Multi-Program Handwriting Papers offer rulings that conform to both the Zaner-Bloser and D'Nealian handwriting programs. Bright tablet paper ruled both sides with red baselines, blue dotted midlines and blue headlines. Recyclable.  • Age group and grade: Grades kindergarten - 1st. • Our multi-program handwriting papers offer rulings that conform to both the Zaner-Bloser and D'Nealian handwriting programs. • Bright tablet paper ruled both sides with red baselines, blue dotted midlines and blue headlines. • Picture story paper is ruled with a 4-1/4\" picture space on both sides. • Tablets have a heavy chipboard back and protective full page, four color, retail-friendly front cover. • Reams are film wrapped with a full page, four color, retail-friendly top sheet. • Ruling: Manuscript (handwriting). • Paper color: White. • Polywrapped: Yes. • Line spacing: 5/8\". • Recyclable. • Sheet size: 10-1/2\" x 8\".  • Sold as 12 pieces/Bundle.",
            " Sold as 12 pieces/Bundle. Age group and grade: Grades kindergarten - 1st. Tablets have a heavy chipboard back and protective full page, four color, retail-friendly front cover. Polywrapped: Yes. Our multi-program handwriting papers offer rulings that conform to both the Zaner-Bloser and D'Nealian handwriting programs. Reams are film wrapped with a full page, four color, retail-friendly top sheet. Line spacing: 5/8\". Bright tablet paper ruled both sides with red baselines, blue dotted midlines and blue headlines. Ruling: Manuscript (handwriting). Recyclable. Picture story paper is ruled with a 4-1/4\" picture space on both sides. Paper color: White. Sheet size: 10-1/2\" x 8\". "
        ]
    },
    {
        "id": "2692658417",
        "url": "https://www.walmart.com/ip/2692658417?selected=true",
        "url_status": "200",
        "type": "Wigs & Toupees",
        "name": "DOPI Real Remy Synthetic Human Hair Bob Hair Gray Wig Toupee Hairpiece Top Wig For Women",
        "brand": "Dopi",
        "manufacturerName": "DOPI",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Brand",
                "value": "Dopi"
            },
            {
                "key": "Wig Cap Type",
                "value": "Monofiliment"
            },
            {
                "key": "Age Group",
                "value": "Adult"
            },
            {
                "key": "Manufacturer",
                "value": "DOPI"
            },
            {
                "key": "Gender",
                "value": "Female"
            }
        ],
        "additionalInfo": [
            "1 PC Real Remy Human Hair Topper Toupee Hairpiece Lace Top Wig For Women  Features:   100% Brand New and high quality.  New women synthetic wigs women heat resistant wig full head  Hair Material High Temperature Wire fiber, made Cap, Seem as real human hair  Comfortable for daily wear; No damage to your own hair  Easy to wash and care.  The inner design is adjustable, so you are able to adjust the size for an ideal fit; The hooks inside the wig are fully adjustable to fit all sizes   Specification:  Style: Short Wig  Texture: Curly hair  Material: Synthetic wig Hair Color: as shown  Hair length：11 Inch  Weight: 150g  How to care: (1) Wash in cold or warm water ,Add a dash of Shampoo and wash gently (2) After shampooing squeeze out excess water and pat dry with a towel (3) Do not brush when wet allow wig to drip fry (4) Clean up with towel and let it dry naturally,  (5) Please do not use hair drier or put it expose to intense heat   Package Include:  1 x  wig    ",
            " Does not contain harmful chemicals materials-safe for you and your family to provide you with a more enjoyable experience appearance, color and texture similar to real hair, confused with real hair, fine workmanship, comfortable hand, easy to clean, small size, easy to carry, can be carried with you or worn everyday  High quality breathable mesh hat is soft and comfortable. The buckle net design can be used for a long time. It will allow you to redesign and easily change your look in seconds. It can give you more confidence and more charm! "
        ]
    },
    {
        "id": "2059580269",
        "url": "https://www.walmart.com/ip/2059580269?selected=true",
        "url_status": "200",
        "type": "Kitchen Utensil Organizers",
        "name": "Adjustable Cutlery Drawer Organizer, Flatware Drawer Tray for Silverware, Serving Utensils, Multi Purpose Organizer Tray for Kitchen, Office, Bathroom Small",
        "brand": "Esquirla",
        "manufacturerName": "Esquirla",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Brand",
                "value": "Esquirla"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "Does Not Apply"
            },
            {
                "key": "Assembled Product Weight",
                "value": "0.24 lb"
            },
            {
                "key": "Manufacturer",
                "value": "Esquirla"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "15.75 x 3.35 x 2.17 Inches"
            }
        ],
        "additionalInfo": [
            "Description: Kitchen Drawer Storage Organizer Tray: These drawer organizer can be used separately divide in different drawers, separatable and expandable to meet your all cutlery, right dimensions all your silverware neatly and comfortably.Premium quality: Kitchen cutlery drawer organizer made of high quality material, washable, smooth surface, thick and durable, not easy to deform.Compartments Divider: With 2 compartment plate, adjustable and sort place setting pieces, , forks, spoons, spatulas, whisks, utensils and other kitchen gadgets, all your silverware neatly, and save space.Multi Use: These organizer divider storage tray can storage baby products, clothes, tableware, toys, toiletry storage, underwear, makeup, snack, stationery and other sundries.Home Organization Solution: These cabinet drawer storage organizer tray perfectly fits large drawers, offer a generous capacity for your sundries and a nice way to customize your drawer layout. Specification: Material: Size Chart: Large Size:34.6x12x5cm/13.62x4.72x1.97inchSmall Size:34.6x8x5cm/13.62x3.15x1.97inch Package Includes: 1 Piece Kitchen Drawer Organizer Tray 2 Pieces Compartment Plate",
            " Compartments Cutlery divider tray Storage drawer storage tray adjustable makeup brush Tableware Silverware Storage Drawer storage box "
        ]
    },
    {
        "id": "47758033",
        "url": "https://www.walmart.com/ip/47758033?selected=true",
        "url_status": "200",
        "type": "Electric Blankets",
        "name": "Biddeford 1001-903292-535 Comfort Knit Fleece Electric Heated Blanket Full Blue",
        "brand": "Biddeford",
        "manufacturerName": "Biddeford",
        "shortDescription": [
            "Energy Saving - Save money on your home heating bills by turning down your thermostat while you use this heated blanketAnalog control provides therapeutic warmth with 10 heat settings and auto shut off featureMachine wash and dry for your convenience, Packaged in a reusable zipper bag with handle100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "Analog control provides therapeutic warmth with 10 heat settings and auto shut off featureMachine wash and dry for your convenience, Packaged in a reusable zipper bag with handle100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "Machine wash and dry for your convenience, Packaged in a reusable zipper bag with handle100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "100% Polyester comfort knit fleece, Ultra-thin wire for added comfortFive Year Manufacturer Warranty",
            "Five Year Manufacturer Warranty"
        ],
        "specifications": [
            {
                "key": "Country of Origin - Textiles",
                "value": "Imported"
            },
            {
                "key": "Assembled Product Weight",
                "value": "6 lb"
            },
            {
                "key": "Bed Size",
                "value": "Full"
            },
            {
                "key": "Fabric Content",
                "value": "100.00% Polyester"
            },
            {
                "key": "Brand",
                "value": "Biddeford"
            },
            {
                "key": "Material",
                "value": "Fleece"
            },
            {
                "key": "Size",
                "value": "Full"
            },
            {
                "key": "Model",
                "value": "1001-903292-535"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "1001-903292-535"
            },
            {
                "key": "Manufacturer",
                "value": "Biddeford"
            },
            {
                "key": "Color",
                "value": "Cloud Blue"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "1.00 x 84.00 x 90.00 Inches"
            }
        ],
        "additionalInfo": [
            "The Biddeford Comfort Knit Fleece Heated Blanket is just the thing to get the chill out when the weather gets nasty. In Full size, cloud blue this magnificently soft polyester blanket is just great for getting warm. Analog controller features 10 personal heat settings, allowing you to get just the right temperature. It also features an automatic shut-off feature, which turns the blanket off after 10 hours. The twin and full size blankets include one controller. The queen and king size blankets include two controllers.  Twin Size (single controller) 62\" X 84\" Full Size (single controller) 72\" X 84\" Queen Size (Dual controllers) 84\" X 90\" King Size (Dual controllers) 100\" X 90\" *Note for Customers Outside of North America. These heated bedding products were made to work with 110V Electrical systems. If you live in a country that utilizes a different electrical system you may need to use a converter for these products to function. The act of using a converter automatically voids the warranty on these products. **All Biddeford Blankets are rigorously tested and approved by a third party (UL or ETK Intertek) to comply with current industry safety standards. Please reference the included use and safety instructions to insure safe operation. Additional safety certification for this product can be viewed on the UL or Intertek websites or by calling their perspective customer care phone numbers. Features:  Energy Saving - Save money on your home heating bills by turning down your thermostat while you use this heated blanket Analog control provides therapeutic warmth with 10 heat settings and auto shut off feature Machine wash and dry for your convenience, Packaged in a reusable zipper bag with handle 100% Polyester comfort knit fleece, Ultra-thin wire for added comfort Five Year Manufacturer Warranty ",
            " Energy Saving - Save money on your home heating bills by turning down your thermostat while you use this heated blanket Analog control provides therapeutic warmth with 10 heat settings and auto shut off feature Machine wash and dry for your convenience, Packaged in a reusable zipper bag with handle 100% Polyester comfort knit fleece, Ultra-thin wire for added comfort Five Year Manufacturer Warranty "
        ]
    },
    {
        "id": "1426349020",
        "url": "https://www.walmart.com/ip/1426349020?selected=true",
        "url_status": "200",
        "type": "Electric Skillets",
        "name": "Electric Nonstick Cooker Skillet Wok Hot Pot Cook Rice Fried Noodle（2.8L,With Steamer）",
        "brand": "Jian Ya Na",
        "manufacturerName": null,
        "shortDescription": [],
        "specifications": [
            {
                "key": "Features",
                "value": "Non-Stick"
            },
            {
                "key": "Brand",
                "value": "Jian Ya Na"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "HTG-047"
            }
        ],
        "additionalInfo": [
            "Why choose Mingfuxin Non-Stick Electric Skillet?Hot pot has two gears, so it is very simple and convenient.At first, you can turn it to the \"high\" position, making it heat rapidly. After food had been cooked completely,you can switch to \"LOW\" position and it will heat persistently.Professional electric chafing dish, make the operation simple, make your life simple.Size:20CM Diameter: suitable for 1-2 people, Power: 300W-600W, Capacity: 2.3L22CM Diameter: suitable for 2 people, Power: 300W-600W, Capacity: 2.8L24CM Diameter: suitable for 2-3 people, Power: 400W-800W, Capacity: 3.2L26CM Diameter: suitable for 3-4 people, Power: 500W-1000W, Capacity: 3.6LSpecification:Voltage: 110VFrequency: 60HzModel: SW - 20Capacity: 2L-3LWeight: 1.5-2kg Package Included:1 x Electric Skillet(Steamer can be added)1 x Power Cord1 x Pair of Chopsticks1 x Wooden Shovel1 x Big Spoon1 x Dishcloth1 x Manual",
            "      1.【Healthy cooking】 coating does not contain harmful chemicals and is PTFE and PFOA free. Deluxe ceramic nonstick coating, for stick-free cooking and easy cleaning. Multi-function electric skillet can be used for cooking, frying, boiling, braising, stewing, steaming.         2.【Premium Material and Durable】High-quality aluminum body and superior round heating element provide faster and even heat distribution when cooking. Durable heat-tempered glass cover that handles high temperatures and steam without breaking.         3.【Safe Protection】With Big Anti-scalding Handle,it's easy and comfortable to grip and touch the Frying Pans,effective heat insulation and anti-scalding. When the water dry or ultra high temperature (higher than 175 ° C) automatic power off to protect your safety.         4.【Convenient to Use】The Electric skillet has fast and slow two heating modes, easy to operate. At the same time, you can use the steaming and boiling method to save you time.         5.【Easy to Care】Pot body can be washed after power off, convenient and safe. Before cleaning, please unplug the power plug and let the pot cool. Do not use the steel ball when washing, please use a soft cleaning cloth, otherwise it will scratch the non- stick layer.    "
        ]
    },
    {
        "id": "1539849254",
        "url": "https://www.walmart.com/ip/1539849254?selected=true",
        "url_status": "200",
        "type": "Mattresses",
        "name": "2 in 1 Full Mattress, 6 inch Memory Foam Mattress, Bed Mattress with Cover, Pressure Relieving Mattress Topper, White",
        "brand": "Yangming",
        "manufacturerName": "Yangming",
        "shortDescription": [],
        "specifications": [
            {
                "key": "Brand",
                "value": "Yangming"
            },
            {
                "key": "Bed Size",
                "value": "Full"
            },
            {
                "key": "Mattress Type",
                "value": "Memory Foam Mattresses"
            },
            {
                "key": "Mattress Comfort Level",
                "value": "Medium Firm"
            },
            {
                "key": "Mattress Thickness",
                "value": "6"
            },
            {
                "key": "Material",
                "value": "Memory Foam"
            },
            {
                "key": "Color",
                "value": "White"
            },
            {
                "key": "Assembled Product Weight",
                "value": "52 lb"
            },
            {
                "key": "Manufacturer",
                "value": "Yangming"
            },
            {
                "key": "Manufacturer Part Number",
                "value": "2 inch 1-White-6"
            },
            {
                "key": "Model",
                "value": "2 inch 1-White-6"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "75.00 x 54.00 x 6.00 Inches"
            }
        ],
        "additionalInfo": [
            "Are you still searching for the perfect mattress? This will be the best mattress you will encounter! We researched the needs of most people, and finally developed this 2 in 1 mattress. When separated, they are two toppers; when combined, they become a new mattress.You can match the color and thickness of the mattress topper to create your own mattress. Gel memory foam adjusts to your body temperature so you can have cool sleep and reduces pressure point. This ergonomic design perfectly conforms to your body shape and is suitable for all sleeper types. This mattress resists sagging, rolling-off, and all this with a medium-firm feel. Being a CertiPUR-US certified foam guarantees you a safe and healthy sleep. The mattresses come compressed in a box and will be smartly shipped to your door for easy setup.   Features:  The gel memory foam mattress slowly adjusts to body weight and temperature to provide you with cool sleep  Ergonomic design conforms to your body from the stomach to your side and finally to the back to keep the body and spine aligned  Great for all sleep types and all sleepers such as the back, stomach, and side sleepers  CertiPUR-US certified foam for healthy and safe sleep. No formaldehyde, low VOCs, and no ozone depletes  Mattress in a box that comes compressed and rolled for shipping and easy setup, your kids can even help  Wait 72 hours for your mattress to fully expand to its original shape   Specifications:  Twin hybrid mattress: 75\" L x 39\" W x 6‘’ or 8\" H  Full hybrid mattress: 75\" L x 54\" W x 6‘’ or 8\" H  Queen hybrid mattress: 80\" L x 60\" W x 6‘’ or 8\" H  King hybrid mattress: 80\" L x 76\" W x 6‘’ or 8\" H ",
            "  Original 2-in-1 Mattress Design: This will be the best mattress you will encounter! We researched the needs of most people, and finally developed this 2 in 1 mattress. When separated, they are two toppers; when combined, they become a new mattress.You can match the color and thickness of the mattress topper to create your own mattress.   No Glass Fiber Flame: Our mattress is made of safe and efficient flame retardant material without glass fiber. There will be no skin irritation, breathing and air pollution issues, so you and your family can rest comfortable on mattress and you can really rest easy at night.   Medium Firmness: Our mattresses have been tested many times, and finally we have created this mattress with moderate firmness. Our mattresses provide you with enough support to sleep without sinking and avoid back problems. Meanwhile, our mattress is made of memory foam, which relieves the pressure on your body.   Easy to clean: Our Mattress topper is designed with zipper, which is convenient for you to disassemble and clean. You can just remove the cover and wash it. The foam can bask in the sun, without the need to wash with water.   Instant Enjoyment: Compressed into a box, it is easy to transport and operate into the bedroom. Just unpack, unfold, and enjoy this mattress.  "
        ]
    },
    {
        "id": "149984760",
        "url": "https://www.walmart.com/ip/149984760?selected=true",
        "url_status": "200",
        "type": "Incontinence Protective Underwear",
        "name": "Prevail Daily Disposable Underwear Small Youth, PV-511, Extra, 88 Ct",
        "brand": "Prevail",
        "manufacturerName": "first quality",
        "shortDescription": [
            "Stay protected from incontinence issues with this Small Adult 88-Count package of Prevail Extra Absorbency Underwear",
            "They have a soft cloth-like Skin Smart inner and outer fabric made with aloe, vitamin E and chamomile for skin wellness",
            "The small adult and youth disposable underwear feature elastic gathers around the leg openings and Advanced Discreet Core technology that locks away moisture quickly to prevent leaks and odors",
            "They also pull up and down just like real underwear for ease of use",
            "The Small Adult 88-Count Prevail Extra Absorbency Underwear are suitable for men and women and children",
            "They come in a four-pack with each bag containing 22 briefs each"
        ],
        "specifications": [
            {
                "key": "Gender",
                "value": "Unisex"
            },
            {
                "key": "Size",
                "value": "S"
            },
            {
                "key": "Scent",
                "value": "Unscented"
            },
            {
                "key": "Brand",
                "value": "Prevail"
            },
            {
                "key": "Absorbency",
                "value": "Moderate"
            },
            {
                "key": "manufacturer_part_number",
                "value": "pv-511"
            },
            {
                "key": "Color",
                "value": "Multicolor"
            },
            {
                "key": "Manufacturer",
                "value": "first quality"
            },
            {
                "key": "Assembled Product Dimensions (L x W x H)",
                "value": "12.15 x 15.60 x 11.55 Inches"
            }
        ],
        "additionalInfo": [
            "Stay protected from incontinence issues with this Small Adult 88-Count package of Prevail Extra Absorbency Underwear. They have a soft cloth-like Skin Smart inner and outer fabric made with aloe, vitamin E and chamomile for skin wellness. The small adult and youth disposable underwear feature elastic gathers around the leg openings and Advanced Discreet Core technology that locks away moisture quickly to prevent leaks and odors. They also pull up and down just like real underwear for ease of use. The Small Adult 88-Count Prevail Extra Absorbency Underwear are suitable for men and women and children. They come in a four-pack with each bag containing 22 briefs each.",
            " Prevail Extra Pull-On Underwear, Youth/Small Adult, 88 Count:   Prevail extra protective underwear goes beyond protecting from leakage associated with moderate leakage associated with urge and mixed incontinence It has improved efficiency by reducing odors and promoting skin health Advanced Discreet core technology has exceptional performance with added comfort and discretion Extra absorbency provides leakage protection and comfort Skin Smart fabric is made with aloe, vitamin E and chamomile for skin wellness Pulls up and down like real underwear Advanced Zoning System Manufacturer # PV-511 Brand: Prevail Extra Manufacturer: First Quality Absorbent capacity: moderate absorbency Application: absorbent underwear Backing material: cloth-like Color: white Gender: unisex HCPCS A4520 T4525 (Disclaimer) Leg style: elastic gathers Size: small Sizing range: 20\" - 34\" waist/hip Style: pull-on Top sheet material: cloth-like UNSPSC code: 53102303 Usage: disposable User: youth Latex-free indicator not made with natural rubber latex 22 per pack, 4 packs per case Labels may vary "
        ]
    }
]